import {useEffect, useState} from "react";
import {TVEvent} from "@/utils/typedefs";

interface Output {
  events: TVEvent[];
  loading: boolean;
}

const eventsNew = [
  {
    "id": 1695,
    "name": "Агенти справедливості, 5 сезон, 56 с. Його друге я",
    "time": "2024-10-03T23:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 1469,
    "name": "Дружина астронавта, 1 ч",
    "time": "2024-10-03T23:50:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 1430,
    "name": "Метод Булла, 5 сезон, 18 с",
    "time": "2024-10-03T23:50:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 1702,
    "name": "Гаваї 5.0, 7 сезон, 9 і 10 с",
    "time": "2024-10-03T23:50:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 2245,
    "name": "Щоденники Темного",
    "time": "2024-10-03T23:45:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 1642,
    "name": "Південний парк, 3 сезон, 9 с",
    "time": "2024-10-03T23:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3722,
    "name": "Фюжн Макс",
    "time": "2024-10-03T23:30:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3552,
    "name": "Південний парк, 3 сезон, 8 с",
    "time": "2024-10-03T23:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 1665,
    "name": "Виходьте без дзвінка, 3 сезон, 23 с. Солодко-гірко",
    "time": "2024-10-03T23:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 2228,
    "name": "Волонтери, 5 с",
    "time": "2024-10-03T23:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2178,
    "name": "Черговий лікар, 4 сезон, 12 с",
    "time": "2024-10-03T23:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 1701,
    "name": "NCIS: Полювання на вбивцю, 8 сезон, 19 с",
    "time": "2024-10-03T23:00:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 1772,
    "name": "Суто англійські вбивства",
    "time": "2024-10-03T23:00:00.000Z",
    "channel": "Enter-фільм",
    "type": "SERIES"
  },
  {
    "id": 2080,
    "name": "Готель Галіція, 1 сезон, 9 і 10 с",
    "time": "2024-10-03T22:55:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 2313,
    "name": "Поліцейські вертольотчики, 1 сезон, 14 с",
    "time": "2024-10-03T22:50:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 1671,
    "name": "Доктор Хаус, 4 сезон, 4 с",
    "time": "2024-10-03T22:50:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 1398,
    "name": "Південний парк, 3 сезон, 7 с",
    "time": "2024-10-03T22:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3703,
    "name": "Захисники Петронікс",
    "time": "2024-10-03T22:40:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2253,
    "name": "Кістки, 11 сезон, 1 і 2 с",
    "time": "2024-10-03T22:40:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 3654,
    "name": "Волонтери, 8 с",
    "time": "2024-10-03T22:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 1476,
    "name": "Брудний коп",
    "time": "2024-10-03T22:20:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 2123,
    "name": "Південний парк, 3 сезон, 6 с",
    "time": "2024-10-03T22:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2052,
    "name": "Дикі Скрічери",
    "time": "2024-10-03T22:15:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3653,
    "name": "Волонтери, 7 с",
    "time": "2024-10-03T22:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2061,
    "name": "Лікарня Вальє Норте, 10 с",
    "time": "2024-10-03T22:00:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 3581,
    "name": "Доктор Хаус, 4 сезон, 3 с",
    "time": "2024-10-03T22:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 2084,
    "name": "Фрейзер, 3 сезон, 21 с",
    "time": "2024-10-03T22:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2070,
    "name": "Поліцейські вертольотчики, 1 сезон, 13 с",
    "time": "2024-10-03T22:00:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 3621,
    "name": "Містер Крутий",
    "time": "2024-10-03T22:00:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 1693,
    "name": "Черговий лікар, 4 сезон, 11 с",
    "time": "2024-10-03T21:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 2168,
    "name": "Джокер, 1 ч",
    "time": "2024-10-03T21:55:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 1837,
    "name": "Одного разу під Полтавою, 229 і 230 с",
    "time": "2024-10-03T21:55:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 1526,
    "name": "Кістки, 10 сезон, 22 с",
    "time": "2024-10-03T21:45:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 1357,
    "name": "Фрейзер, 3 сезон, 20 с",
    "time": "2024-10-03T21:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1545,
    "name": "Блиск і монстрмашини",
    "time": "2024-10-03T21:30:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 1942,
    "name": "NCIS: Полювання на вбивцю, 12 сезон, 3 і 4 с",
    "time": "2024-10-03T21:15:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 2069,
    "name": "Гаряча точка, 5 сезон, 10 с",
    "time": "2024-10-03T21:15:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 1638,
    "name": "Король Квінса, 1 сезон, 14 с",
    "time": "2024-10-03T21:05:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1664,
    "name": "Доньки-матері, 36 с",
    "time": "2024-10-03T21:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 3586,
    "name": "Окуповані, 3 і 4 с",
    "time": "2024-10-03T21:00:00.000Z",
    "channel": "1+1 International",
    "type": "SERIES"
  },
  {
    "id": 1911,
    "name": "Жіночий лікар. Нове життя 2",
    "time": "2024-10-03T21:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 2237,
    "name": "Мислити як вбивця",
    "time": "2024-10-03T20:55:00.000Z",
    "channel": "Сонце",
    "type": "SERIES"
  },
  {
    "id": 3603,
    "name": "Квіти дощу, 8 с",
    "time": "2024-10-03T20:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 1594,
    "name": "Одного разу під Полтавою, 195 і 196 с",
    "time": "2024-10-03T20:55:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 2251,
    "name": "Медіум, 7 сезон, 1 с",
    "time": "2024-10-03T20:55:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 1637,
    "name": "Король Квінса, 1 сезон, 13 с",
    "time": "2024-10-03T20:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1421,
    "name": "Доньки-матері, 35 с",
    "time": "2024-10-03T20:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 2310,
    "name": "Гаряча точка, 5 сезон, 9 с",
    "time": "2024-10-03T20:25:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 2201,
    "name": "Ворон та Воробйов, 15 і 16 с",
    "time": "2024-10-03T20:15:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 1878,
    "name": "Король Квінса, 1 сезон, 12 с",
    "time": "2024-10-03T20:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2225,
    "name": "Трансформери: Час вимирання",
    "time": "2024-10-03T20:00:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 2000,
    "name": "Заборонений плід",
    "time": "2024-10-03T20:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 1904,
    "name": "Доньки-матері, 34 с",
    "time": "2024-10-03T20:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 1449,
    "name": "Квіти дощу, 7 с",
    "time": "2024-10-03T20:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 3661,
    "name": "Мангровий гай, 4 с",
    "time": "2024-10-03T20:00:00.000Z",
    "channel": "К2",
    "type": "MOVIE"
  },
  {
    "id": 2004,
    "name": "Медіум, 6 сезон, 22 с",
    "time": "2024-10-03T20:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 1583,
    "name": "Гаряча точка, 5 сезон, 8 с",
    "time": "2024-10-03T19:30:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 2145,
    "name": "Доньки-матері, 33 с",
    "time": "2024-10-03T19:30:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 1902,
    "name": "Доньки-матері, 32 с",
    "time": "2024-10-03T19:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 2118,
    "name": "Усі ненавидять Кріса, 1 сезон, 22 с",
    "time": "2024-10-03T19:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1351,
    "name": "Джек і Лондон, 7 і 8 с",
    "time": "2024-10-03T19:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 1391,
    "name": "Усі ненавидять Кріса, 1 сезон, 21 с",
    "time": "2024-10-03T18:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1659,
    "name": "Доньки-матері, 31 с",
    "time": "2024-10-03T18:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 2060,
    "name": "Центральна лікарня, 20 і 21 с",
    "time": "2024-10-03T18:25:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 1749,
    "name": "Криваві квіти, 47 і 48 с",
    "time": "2024-10-03T18:20:00.000Z",
    "channel": "К2",
    "type": "SERIES"
  },
  {
    "id": 1632,
    "name": "Беккер, 4 сезон, 16 с",
    "time": "2024-10-03T18:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1416,
    "name": "Доньки-матері, 30 с",
    "time": "2024-10-03T18:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 1674,
    "name": "Опер за викликом, 4 сезон, 11 і 12 с",
    "time": "2024-10-03T18:00:00.000Z",
    "channel": "1+1 International",
    "type": "SERIES"
  },
  {
    "id": 3671,
    "name": "Крила кохання",
    "time": "2024-10-03T18:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 1683,
    "name": "Коп із минулого 2, 5-8 с",
    "time": "2024-10-03T18:00:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 2174,
    "name": "Слід. Та що харчується кровю",
    "time": "2024-10-03T17:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 3542,
    "name": "Беккер, 4 сезон, 15 с",
    "time": "2024-10-03T17:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3568,
    "name": "Доньки-матері, 29 с",
    "time": "2024-10-03T17:30:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 1872,
    "name": "Король Квінса, 1 сезон, 11 с",
    "time": "2024-10-03T17:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2140,
    "name": "Доньки-матері, 28 с",
    "time": "2024-10-03T17:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 3600,
    "name": "Слід. У борговій петлі",
    "time": "2024-10-03T17:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 2200,
    "name": "Копальні царя Соломона",
    "time": "2024-10-03T17:00:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 1497,
    "name": "Дієта №0, 12 с",
    "time": "2024-10-03T17:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2152,
    "name": "Метод Булла, 5 сезон, 17 с",
    "time": "2024-10-03T16:55:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 1817,
    "name": "Обручка з рубіном, 40 і 41 с",
    "time": "2024-10-03T16:40:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 1766,
    "name": "Інспектор Алекс, 11 сезон, 5-8 с",
    "time": "2024-10-03T16:35:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 1897,
    "name": "Доньки-матері, 27 с",
    "time": "2024-10-03T16:30:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 2275,
    "name": "Монстр Хай",
    "time": "2024-10-03T16:25:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3539,
    "name": "Король Квінса, 1 сезон, 9 с",
    "time": "2024-10-03T16:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1654,
    "name": "Доньки-матері, 26 с",
    "time": "2024-10-03T16:10:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 3538,
    "name": "Правила спільного життя, 2 сезон, 14 с",
    "time": "2024-10-03T16:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1980,
    "name": "Дієта №0, 11 с",
    "time": "2024-10-03T16:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 3593,
    "name": "Стартрек: За межами Всесвіту",
    "time": "2024-10-03T15:45:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 1653,
    "name": "Доньки-матері, 25 с",
    "time": "2024-10-03T15:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 1626,
    "name": "Правила спільного життя, 2 сезон, 13 с",
    "time": "2024-10-03T15:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3584,
    "name": "Нове життя Василини Павлівни, 9-12 с",
    "time": "2024-10-03T15:25:00.000Z",
    "channel": "1+1 International",
    "type": "SERIES"
  },
  {
    "id": 2136,
    "name": "Доньки-матері, 24 с",
    "time": "2024-10-03T15:10:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 3536,
    "name": "Шоу Рена та Стімпі, 1 сезон, 4 с",
    "time": "2024-10-03T15:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 1715,
    "name": "Майор Пейн",
    "time": "2024-10-03T15:00:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 1979,
    "name": "Усі жінки - відьми, 4 сезон, 18 с",
    "time": "2024-10-03T15:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 1950,
    "name": "Клік: Із пультом по життю",
    "time": "2024-10-03T14:55:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 1382,
    "name": "Губка Боб Квадратні Штани, 1 сезон, 4 с",
    "time": "2024-10-03T14:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2181,
    "name": "NCIS: Полювання на вбивцю, 8 сезон, 18 с",
    "time": "2024-10-03T14:45:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 1893,
    "name": "Доньки-матері, 23 с",
    "time": "2024-10-03T14:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 1533,
    "name": "Гав-Гав-Гав",
    "time": "2024-10-03T14:30:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 1408,
    "name": "Доньки-матері, 22 с",
    "time": "2024-10-03T14:10:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 1824,
    "name": "Гаряча точка, 5 сезон, 7 с",
    "time": "2024-10-03T14:05:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 1494,
    "name": "Усі жінки - відьми, 4 сезон, 17 с",
    "time": "2024-10-03T14:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2284,
    "name": "КазУм-Кідс Гардієнз",
    "time": "2024-10-03T13:55:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 1816,
    "name": "Земля вовків, 3 сезон, 7 і 8 с",
    "time": "2024-10-03T13:50:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 1765,
    "name": "Кістки, 10 сезон, 19-21 с",
    "time": "2024-10-03T13:50:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 1407,
    "name": "Доньки-матері, 21 с",
    "time": "2024-10-03T13:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 1681,
    "name": "Стелс",
    "time": "2024-10-03T13:25:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 2132,
    "name": "Доньки-матері, 20 с",
    "time": "2024-10-03T13:15:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 1493,
    "name": "Усі жінки - відьми, 4 сезон, 16 с",
    "time": "2024-10-03T13:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 1465,
    "name": "Гроші вирішують все",
    "time": "2024-10-03T13:00:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 2006,
    "name": "Медіум, 6 сезон, 21 с",
    "time": "2024-10-03T13:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 1889,
    "name": "Доньки-матері, 19 с",
    "time": "2024-10-03T12:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 3694,
    "name": "Вісспер",
    "time": "2024-10-03T12:30:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2038,
    "name": "Бабілунс",
    "time": "2024-10-03T12:30:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2306,
    "name": "Гаряча точка, 5 сезон, 5 с",
    "time": "2024-10-03T12:20:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 1976,
    "name": "Усі жінки - відьми, 4 сезон, 15 с",
    "time": "2024-10-03T12:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2299,
    "name": "Хадсон і Рекс, 55 с",
    "time": "2024-10-03T11:45:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 2279,
    "name": "Вулиця Сезам",
    "time": "2024-10-03T11:40:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 1706,
    "name": "Кунґ-фу панда 2",
    "time": "2024-10-03T11:10:00.000Z",
    "channel": "Новий канал",
    "type": "CARTOON"
  },
  {
    "id": 2217,
    "name": "Жива вода",
    "time": "2024-10-03T11:00:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 1538,
    "name": "Супергерой Коді",
    "time": "2024-10-03T11:00:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 1680,
    "name": "CSI: Місце злочину - Маямі, 6 сезон, 4-6 с",
    "time": "2024-10-03T10:30:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 3704,
    "name": "Крихітка Кро",
    "time": "2024-10-03T10:15:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 1375,
    "name": "Король Квінса, 3 сезон, 8 с",
    "time": "2024-10-03T10:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3625,
    "name": "Касл, 7 сезон, 15 і 16 с",
    "time": "2024-10-03T10:00:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 1732,
    "name": "Осляча шкура",
    "time": "2024-10-03T10:00:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 1858,
    "name": "Король Квінса, 3 сезон, 7 с",
    "time": "2024-10-03T09:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3526,
    "name": "Король Квінса, 3 сезон, 6 с",
    "time": "2024-10-03T09:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1350,
    "name": "Одного разу під Полтавою, 193 і 194 с",
    "time": "2024-10-03T09:10:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 1930,
    "name": "Комісар Рекс, 5 сезон, 8 с",
    "time": "2024-10-03T08:50:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 3524,
    "name": "Усі ненавидять Кріса, 1 сезон, 17 с",
    "time": "2024-10-03T08:30:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1990,
    "name": "Криваві квіти, 45 і 46 с",
    "time": "2024-10-03T08:25:00.000Z",
    "channel": "К2",
    "type": "SERIES"
  },
  {
    "id": 1591,
    "name": "Одного разу під Полтавою, 155 і 156 с",
    "time": "2024-10-03T08:10:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 1445,
    "name": "Комісар Рекс, 5 сезон, 7 с",
    "time": "2024-10-03T07:50:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 3642,
    "name": "Прибулець, 2 сезон, 12 с",
    "time": "2024-10-03T07:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 3624,
    "name": "Касл, 7 сезон, 8-10 с",
    "time": "2024-10-03T07:15:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 2094,
    "name": "Беккер, 4 сезон, 11 с",
    "time": "2024-10-03T07:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2214,
    "name": "Прибулець, 2 сезон, 11 с",
    "time": "2024-10-03T07:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 3597,
    "name": "Комісар Рекс, 5 сезон, 6 с",
    "time": "2024-10-03T06:50:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 1366,
    "name": "Теле-тато у відставці, 3 сезон, 15 с",
    "time": "2024-10-03T06:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1832,
    "name": "Одного разу під Полтавою, 115 і 116 с",
    "time": "2024-10-03T06:05:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 1365,
    "name": "Теле-тато у відставці, 3 сезон, 14 с",
    "time": "2024-10-03T06:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2212,
    "name": "Прибулець, 2 сезон, 9 с",
    "time": "2024-10-03T06:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2005,
    "name": "Великі Вуйки, 1-4 с",
    "time": "2024-10-03T06:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 1485,
    "name": "Коп і Штик - завзяті кроти",
    "time": "2024-10-03T05:50:00.000Z",
    "channel": "ТЕТ",
    "type": "CARTOON"
  },
  {
    "id": 1484,
    "name": "Одного разу під Полтавою, 14 сезон, 20 с",
    "time": "2024-10-03T05:20:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2088,
    "name": "Теле-тато у відставці, 3 сезон, 11 с",
    "time": "2024-10-03T04:55:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1967,
    "name": "Вечірка 2, 8 с",
    "time": "2024-10-03T04:50:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 1747,
    "name": "Дівчина зеленої долини, 5 і 6 с",
    "time": "2024-10-03T04:45:00.000Z",
    "channel": "К1",
    "type": "SERIES"
  },
  {
    "id": 1482,
    "name": "Вечірка 2, 7 с",
    "time": "2024-10-03T04:20:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 1919,
    "name": "Чак, 4 сезон, 2 і 3 с",
    "time": "2024-10-03T03:45:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 1831,
    "name": "Одного разу під Полтавою, 227 і 228 с",
    "time": "2024-10-03T03:40:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 2207,
    "name": "Королі палат, 16 с",
    "time": "2024-10-03T03:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 1722,
    "name": "Королі палат, 15 с",
    "time": "2024-10-03T03:05:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 3557,
    "name": "Загадка для Анни, 8 с",
    "time": "2024-10-03T03:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 1999,
    "name": "Хамелеон, 4 с",
    "time": "2024-10-03T03:05:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 2230,
    "name": "Дівчина зеленої долини, 9 і 10 с",
    "time": "2024-10-03T03:00:00.000Z",
    "channel": "К1",
    "type": "SERIES"
  },
  {
    "id": 1479,
    "name": "Одного разу під Полтавою, 3 сезон, 6 с",
    "time": "2024-10-03T02:35:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 1514,
    "name": "Щоденники Темного, 28 с",
    "time": "2024-10-03T02:35:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 1588,
    "name": "Зірконавти, 11 і 12 с",
    "time": "2024-10-03T02:30:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 3556,
    "name": "Загадка для Анни, 7 с",
    "time": "2024-10-03T02:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 3513,
    "name": "Брод Сіті, 1 сезон, 6 с",
    "time": "2024-10-03T02:05:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3589,
    "name": "CSI: Місце злочину - Маямі, 5 сезон, 23 і 24 с",
    "time": "2024-10-03T02:05:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 3512,
    "name": "Брод Сіті, 1 сезон, 5 с",
    "time": "2024-10-03T01:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 1962,
    "name": "Одного разу під Полтавою, 3 сезон, 19 с",
    "time": "2024-10-03T01:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2238,
    "name": "Щоденники Темного, 26 с",
    "time": "2024-10-03T01:20:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 2203,
    "name": "Одного разу під Полтавою, 14 сезон, 1 с",
    "time": "2024-10-03T01:05:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 1644,
    "name": "Виходьте без дзвінка, 3 сезон, 22 с. Таємниця Ніколь",
    "time": "2024-10-03T01:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 1685,
    "name": "Агенти справедливості, 5 сезон, 55 с. Контракт із дияволом",
    "time": "2024-10-03T00:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 1908,
    "name": "Метод Булла, 6 сезон, 2 с",
    "time": "2024-10-03T00:45:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 2082,
    "name": "Південний парк, 3 сезон, 5 с",
    "time": "2024-10-03T00:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 1461,
    "name": "Прометей, 2 ч",
    "time": "2024-10-03T00:10:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 1676,
    "name": "Стелс, 2 ч",
    "time": "2024-10-03T00:10:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 2127,
    "name": "Виходьте без дзвінка, 3 сезон, 21 с. Найдовший день року",
    "time": "2024-10-03T00:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 1954,
    "name": "Касл, 7 сезон, 5 і 6 с",
    "time": "2024-10-03T00:05:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 2081,
    "name": "Південний парк, 3 сезон, 4 с",
    "time": "2024-10-03T00:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2296,
    "name": "Пані покоївка",
    "time": "2024-10-03T00:00:00.000Z",
    "channel": "5 канал",
    "type": "SERIES"
  },
  {
    "id": 4076,
    "name": "Агенти справедливості, 5 сезон, 54 с. Ненависть у спадок",
    "time": "2024-10-02T23:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 2893,
    "name": "Гаваї 5.0, 7 сезон, 7 і 8 с",
    "time": "2024-10-02T23:50:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 4053,
    "name": "Метод Булла, 6 сезон, 1 с",
    "time": "2024-10-02T23:50:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 4269,
    "name": "Південний парк, 3 сезон, 3 с",
    "time": "2024-10-02T23:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3408,
    "name": "Волонтери, 4 с",
    "time": "2024-10-02T23:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2748,
    "name": "Оггі та кукарачі",
    "time": "2024-10-02T23:20:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 4268,
    "name": "Південний парк, 3 сезон, 1 с",
    "time": "2024-10-02T23:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2900,
    "name": "Прометей, 1 ч",
    "time": "2024-10-02T23:05:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 3330,
    "name": "Виходьте без дзвінка, 3 сезон, 20 с. Помста раба",
    "time": "2024-10-02T23:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 3170,
    "name": "Волонтери, 3 с",
    "time": "2024-10-02T23:05:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 3359,
    "name": "Черговий лікар, 4 сезон, 10 с",
    "time": "2024-10-02T23:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 3815,
    "name": "Доктор Хаус, 4 сезон, 2 с",
    "time": "2024-10-02T22:55:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 4223,
    "name": "Готель Галіція, 1 сезон, 7 і 8 с",
    "time": "2024-10-02T22:55:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 3024,
    "name": "Поліцейські вертольотчики, 1 сезон, 12 с",
    "time": "2024-10-02T22:50:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 3406,
    "name": "Волонтери, 6 с",
    "time": "2024-10-02T22:25:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 3792,
    "name": "Південний парк, 2 сезон, 15 с",
    "time": "2024-10-02T22:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3144,
    "name": "Кендімен",
    "time": "2024-10-02T22:15:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 2777,
    "name": "Лікарня Вальє Норте, 9 с",
    "time": "2024-10-02T22:10:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 2861,
    "name": "Доктор Хаус, 4 сезон, 1 с",
    "time": "2024-10-02T22:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 3753,
    "name": "Фрейзер, 3 сезон, 19 с",
    "time": "2024-10-02T22:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3121,
    "name": "Черговий лікар, 4 сезон, 9 с",
    "time": "2024-10-02T21:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 3112,
    "name": "Стелс, 1 ч",
    "time": "2024-10-02T21:55:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 2719,
    "name": "Заборонений плід, 429 с",
    "time": "2024-10-02T21:50:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 3916,
    "name": "Кістки, 10 сезон, 20-22 с",
    "time": "2024-10-02T21:45:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 3273,
    "name": "Фрейзер, 3 сезон, 18 с",
    "time": "2024-10-02T21:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3373,
    "name": "Перший удар",
    "time": "2024-10-02T21:35:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 3939,
    "name": "Губка Боб Квадратні Штани",
    "time": "2024-10-02T21:30:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 4318,
    "name": "NCIS: Полювання на вбивцю, 12 сезон, 1 і 2 с",
    "time": "2024-10-02T21:15:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 3340,
    "name": "Окуповані, 1 і 2 с",
    "time": "2024-10-02T21:00:00.000Z",
    "channel": "1+1 International",
    "type": "SERIES"
  },
  {
    "id": 3478,
    "name": "Тара Данкан",
    "time": "2024-10-02T21:00:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3097,
    "name": "Жіночий лікар. Нове життя 2, 35 с",
    "time": "2024-10-02T21:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 3483,
    "name": "Бюро легенд",
    "time": "2024-10-02T21:00:00.000Z",
    "channel": "Еко ТV",
    "type": "SERIES"
  },
  {
    "id": 2982,
    "name": "Морські пригоди Сантьяго",
    "time": "2024-10-02T21:00:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2883,
    "name": "Квіти дощу, 6 с",
    "time": "2024-10-02T20:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 3192,
    "name": "Заборонений плід, 428 с",
    "time": "2024-10-02T20:55:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 4264,
    "name": "Король Квінса, 1 сезон, 10 с",
    "time": "2024-10-02T20:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3808,
    "name": "Виходьте без дзвінка, 3 сезон, 36 с. Чужий, поганий, свій",
    "time": "2024-10-02T20:30:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 4408,
    "name": "Кафе Баттербін",
    "time": "2024-10-02T20:30:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2784,
    "name": "Гаряча точка, 5 сезон, 6 с",
    "time": "2024-10-02T20:25:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 3380,
    "name": "Ворон та Воробйов, 13 і 14 с",
    "time": "2024-10-02T20:15:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 3003,
    "name": "Гігантозавр",
    "time": "2024-10-02T20:05:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 4072,
    "name": "Квіти дощу, 5 с",
    "time": "2024-10-02T20:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 2725,
    "name": "Медіум, 6 сезон, 20 і 21 с",
    "time": "2024-10-02T20:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 3812,
    "name": "Жіночий лікар. Нове життя 2, 34 с",
    "time": "2024-10-02T20:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 4381,
    "name": "Заборонений плід, 427 с",
    "time": "2024-10-02T20:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 2835,
    "name": "Правила спільного життя, 2 сезон, 10 с",
    "time": "2024-10-02T19:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 4425,
    "name": "Смурфики",
    "time": "2024-10-02T19:45:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2366,
    "name": "Південний парк, 2 сезон, 16 с",
    "time": "2024-10-02T19:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2617,
    "name": "Виходьте без дзвінка, 3 сезон, 35 с. Рука і серце",
    "time": "2024-10-02T19:25:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 3774,
    "name": "Правила спільного життя, 2 сезон, 9 с",
    "time": "2024-10-02T19:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3364,
    "name": "Дрон",
    "time": "2024-10-02T19:20:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 3404,
    "name": "Трансформери: Помста полеглих",
    "time": "2024-10-02T19:20:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 4380,
    "name": "Крила кохання, 157 с",
    "time": "2024-10-02T19:05:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 2793,
    "name": "Джек і Лондон, 5 і 6 с",
    "time": "2024-10-02T19:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 2549,
    "name": "Поліцейські вертольотчики, 1 сезон, 11 с",
    "time": "2024-10-02T19:00:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 3307,
    "name": "Усі ненавидять Кріса, 1 сезон, 19 с",
    "time": "2024-10-02T18:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3806,
    "name": "Виходьте без дзвінка, 3 сезон, 34 с. Гра на випередження",
    "time": "2024-10-02T18:25:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 4440,
    "name": "Центральна лікарня, 19 і 20 с",
    "time": "2024-10-02T18:25:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 4427,
    "name": "Щенячий патруль",
    "time": "2024-10-02T18:20:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3306,
    "name": "Беккер, 4 сезон, 14 с",
    "time": "2024-10-02T18:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3818,
    "name": "Опер за викликом, 4 сезон, 9 і 10 с",
    "time": "2024-10-02T18:00:00.000Z",
    "channel": "1+1 International",
    "type": "SERIES"
  },
  {
    "id": 2493,
    "name": "Пуаро Агати Крісті, 9 сезон, 3 с",
    "time": "2024-10-02T18:00:00.000Z",
    "channel": "Enter-фільм",
    "type": "SERIES"
  },
  {
    "id": 4308,
    "name": "Слід. З висоти пташиного польоту",
    "time": "2024-10-02T17:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 3228,
    "name": "Суперкрила: Джетт і його друзі",
    "time": "2024-10-02T17:50:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 4258,
    "name": "Беккер, 4 сезон, 13 с",
    "time": "2024-10-02T17:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3089,
    "name": "Виходьте без дзвінка, 3 сезон, 33 с. Отруєне свято",
    "time": "2024-10-02T17:25:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 2830,
    "name": "Король Квінса, 1 сезон, 8 с",
    "time": "2024-10-02T17:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2465,
    "name": "Мангровий гай, 3 с",
    "time": "2024-10-02T17:00:00.000Z",
    "channel": "К2",
    "type": "MOVIE"
  },
  {
    "id": 4070,
    "name": "Слід. Серцева рана",
    "time": "2024-10-02T17:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 4378,
    "name": "Крила кохання, 155 с",
    "time": "2024-10-02T17:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 2857,
    "name": "Метод Булла, 5 сезон, 16 с",
    "time": "2024-10-02T16:55:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 4019,
    "name": "Король Квінса, 1 сезон, 7 с",
    "time": "2024-10-02T16:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 4202,
    "name": "Обручка з рубіном, 39 і 40 с",
    "time": "2024-10-02T16:40:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 4095,
    "name": "Залишені",
    "time": "2024-10-02T16:40:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 3135,
    "name": "Звязок",
    "time": "2024-10-02T16:35:00.000Z",
    "channel": "Новий канал",
    "type": "SERIES"
  },
  {
    "id": 3166,
    "name": "Трансформери",
    "time": "2024-10-02T16:35:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 4041,
    "name": "Виходьте без дзвінка, 3 сезон, 32 с. Ніч. Вулиця. Ліхтар. Труп",
    "time": "2024-10-02T16:30:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 2751,
    "name": "Барбі - трохи магії",
    "time": "2024-10-02T16:30:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3198,
    "name": "Інспектор Алекс, 11 сезон, 1-4 с",
    "time": "2024-10-02T16:30:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 2591,
    "name": "Король Квінса, 1 сезон, 6 с",
    "time": "2024-10-02T16:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3002,
    "name": "Будинок з сюрпризом",
    "time": "2024-10-02T16:15:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2940,
    "name": "Злочин у раю",
    "time": "2024-10-02T16:15:00.000Z",
    "channel": "Сонце",
    "type": "SERIES"
  },
  {
    "id": 3424,
    "name": "Крила кохання, 154 с",
    "time": "2024-10-02T16:05:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 4191,
    "name": "Рейнбоу Хай",
    "time": "2024-10-02T16:05:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2360,
    "name": "Усі ненавидять Кріса, 1 сезон, 20 с",
    "time": "2024-10-02T16:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2621,
    "name": "Метод Булла, 5 сезон, 14 с",
    "time": "2024-10-02T16:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 3826,
    "name": "300 спартанців: Відродження імперії",
    "time": "2024-10-02T16:00:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 3301,
    "name": "Правила спільного життя, 2 сезон, 12 с",
    "time": "2024-10-02T16:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3919,
    "name": "Пуаро Агати Крісті, 9 сезон, 1 с",
    "time": "2024-10-02T15:35:00.000Z",
    "channel": "Enter-фільм",
    "type": "SERIES"
  },
  {
    "id": 4316,
    "name": "NCIS: Полювання на вбивцю, 11 сезон, 23 і 24 с",
    "time": "2024-10-02T15:35:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 2589,
    "name": "Правила спільного життя, 2 сезон, 11 с",
    "time": "2024-10-02T15:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 4040,
    "name": "Виходьте без дзвінка, 3 сезон, 31 с. Смерть на асфальті",
    "time": "2024-10-02T15:30:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 3338,
    "name": "Нове життя Василини Павлівни, 5-8 с",
    "time": "2024-10-02T15:20:00.000Z",
    "channel": "1+1 International",
    "type": "SERIES"
  },
  {
    "id": 3299,
    "name": "Шоу Рена та Стімпі, 1 сезон, 3 с",
    "time": "2024-10-02T15:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2478,
    "name": "Крила кохання, 156 с",
    "time": "2024-10-02T15:05:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 3902,
    "name": "Заборонений плід, 426 с",
    "time": "2024-10-02T15:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 2400,
    "name": "Коп із минулого 2, 3-6 с",
    "time": "2024-10-02T14:55:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 2824,
    "name": "Губка Боб Квадратні Штани, 1 сезон, 3 с",
    "time": "2024-10-02T14:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 4039,
    "name": "Виходьте без дзвінка, 3 сезон, 30 с. Останній рейс",
    "time": "2024-10-02T14:30:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 2490,
    "name": "Розслідування Мердока",
    "time": "2024-10-02T14:30:00.000Z",
    "channel": "Enter-фільм",
    "type": "SERIES"
  },
  {
    "id": 4209,
    "name": "Гаряча точка, 5 сезон, 4 с",
    "time": "2024-10-02T14:05:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 4094,
    "name": "Зломники",
    "time": "2024-10-02T14:00:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 4375,
    "name": "Заборонений плід, 425 с",
    "time": "2024-10-02T14:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 4201,
    "name": "Земля вовків, 3 сезон, 6 і 7 с",
    "time": "2024-10-02T13:50:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 4087,
    "name": "Острів",
    "time": "2024-10-02T13:50:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 2723,
    "name": "Кістки, 10 сезон, 17-19 с",
    "time": "2024-10-02T13:50:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 3825,
    "name": "300 спартанців",
    "time": "2024-10-02T13:45:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 4392,
    "name": "Пуаро Агати Крісті",
    "time": "2024-10-02T13:40:00.000Z",
    "channel": "Enter-фільм",
    "type": "SERIES"
  },
  {
    "id": 4038,
    "name": "Виходьте без дзвінка, 3 сезон, 29 с. Монстр повертається",
    "time": "2024-10-02T13:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 2586,
    "name": "Усі ненавидять Кріса, 1 сезон, 18 с",
    "time": "2024-10-02T13:30:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 4407,
    "name": "Іскорки суперсил",
    "time": "2024-10-02T13:30:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3900,
    "name": "Заборонений плід, 424 с",
    "time": "2024-10-02T13:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 4149,
    "name": "Медіум, 6 сезон, 19 с",
    "time": "2024-10-02T13:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 4207,
    "name": "Гаряча точка, 5 сезон, 2 с",
    "time": "2024-10-02T12:20:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 2732,
    "name": "Хоробрі зайці",
    "time": "2024-10-02T12:10:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 4246,
    "name": "Беккер, 4 сезон, 12 с",
    "time": "2024-10-02T11:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3945,
    "name": "Вулиця Сезам. У колі друзів",
    "time": "2024-10-02T11:45:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3484,
    "name": "Хадсон і Рекс, 54 с",
    "time": "2024-10-02T11:30:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 4086,
    "name": "Ґодзила",
    "time": "2024-10-02T11:00:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 4298,
    "name": "CSI: Місце злочину - Маямі, 6 сезон, 1-3 с",
    "time": "2024-10-02T11:00:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 2923,
    "name": "Диявол із трьома золотими волосинами",
    "time": "2024-10-02T10:35:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 2544,
    "name": "Гаряча точка, 5 сезон, 3 с",
    "time": "2024-10-02T10:15:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 3770,
    "name": "Король Квінса, 3 сезон, 5 с",
    "time": "2024-10-02T10:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2413,
    "name": "Гаваї 5.0, 7 сезон, 5 і 6 с",
    "time": "2024-10-02T10:00:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 3769,
    "name": "Король Квінса, 3 сезон, 4 с",
    "time": "2024-10-02T09:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2451,
    "name": "Усі жінки - відьми, 4 сезон, 14 с",
    "time": "2024-10-02T09:40:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 4349,
    "name": "Рапунцель",
    "time": "2024-10-02T09:25:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 2815,
    "name": "Король Квінса, 3 сезон, 3 с",
    "time": "2024-10-02T09:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2346,
    "name": "Правила спільного життя, 2 сезон, 8 с",
    "time": "2024-10-02T09:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3856,
    "name": "Касл, 7 сезон, 12-14 с",
    "time": "2024-10-02T09:05:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 3344,
    "name": "Відділ 44",
    "time": "2024-10-02T09:05:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 4322,
    "name": "Мерлін",
    "time": "2024-10-02T09:01:00.000Z",
    "channel": "Новий канал",
    "type": "SERIES"
  },
  {
    "id": 2792,
    "name": "Одного разу під Полтавою, 191 і 192 с",
    "time": "2024-10-02T09:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 3767,
    "name": "Усі ненавидять Кріса, 1 сезон, 16 с",
    "time": "2024-10-02T08:55:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2813,
    "name": "Усі ненавидять Кріса, 1 сезон, 15 с",
    "time": "2024-10-02T08:30:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3765,
    "name": "Фрейзер, 3 сезон, 16 с",
    "time": "2024-10-02T08:05:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2791,
    "name": "Одного разу під Полтавою, 153 і 154 с",
    "time": "2024-10-02T08:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 3115,
    "name": "Комісар Рекс, 5 сезон, 4 с",
    "time": "2024-10-02T07:50:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 3764,
    "name": "Фрейзер, 3 сезон, 15 с",
    "time": "2024-10-02T07:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3376,
    "name": "Касл, 7 сезон, 6 і 7 с",
    "time": "2024-10-02T07:15:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 2573,
    "name": "Беккер, 4 сезон, 9 с",
    "time": "2024-10-02T07:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2684,
    "name": "Прибулець, 2 сезон, 10 с",
    "time": "2024-10-02T07:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2640,
    "name": "Комісар Рекс, 5 сезон, 3 с",
    "time": "2024-10-02T06:50:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 3046,
    "name": "Беккер, 4 сезон, 8 с",
    "time": "2024-10-02T06:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2958,
    "name": "Село на мільйон, 2 сезон, 11 і 12 с",
    "time": "2024-10-02T06:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 4217,
    "name": "Одного разу під Полтавою, 113 і 114 с",
    "time": "2024-10-02T05:55:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 3392,
    "name": "Казки про машини",
    "time": "2024-10-02T05:50:00.000Z",
    "channel": "ТЕТ",
    "type": "CARTOON"
  },
  {
    "id": 2405,
    "name": "Комісар Рекс, 5 сезон, 5 с",
    "time": "2024-10-02T05:50:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 2463,
    "name": "Криваві квіти, 43 і 44 с",
    "time": "2024-10-02T05:25:00.000Z",
    "channel": "К2",
    "type": "SERIES"
  },
  {
    "id": 4344,
    "name": "Одного разу під Полтавою, 3 сезон, 2 с",
    "time": "2024-10-02T05:25:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 4400,
    "name": "Місія Блейк",
    "time": "2024-10-02T05:00:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 3041,
    "name": "Теле-тато у відставці, 3 сезон, 9 с",
    "time": "2024-10-02T04:55:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3252,
    "name": "Поліцейські вертольотчики, 1 сезон, 9 с",
    "time": "2024-10-02T04:35:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 2678,
    "name": "Вечірка 2, 6 с",
    "time": "2024-10-02T04:35:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 3993,
    "name": "Теле-тато у відставці, 3 сезон, 8 с",
    "time": "2024-10-02T04:30:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 3342,
    "name": "Чак, 4 сезон, 1 с",
    "time": "2024-10-02T04:25:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 4363,
    "name": "Дівчина зеленої долини, 3 і 4 с",
    "time": "2024-10-02T04:20:00.000Z",
    "channel": "К1",
    "type": "SERIES"
  },
  {
    "id": 3867,
    "name": "Одного разу під Полтавою, 3 сезон, 8 с",
    "time": "2024-10-02T04:05:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 3800,
    "name": "Загадка для Анни, 6 с",
    "time": "2024-10-02T03:45:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 2552,
    "name": "Одного разу під Полтавою, 225 і 226 с",
    "time": "2024-10-02T03:30:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 3420,
    "name": "Хамелеон, 3 с",
    "time": "2024-10-02T03:05:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 4362,
    "name": "Дівчина зеленої долини, 7 і 8 с",
    "time": "2024-10-02T03:00:00.000Z",
    "channel": "К1",
    "type": "SERIES"
  },
  {
    "id": 2333,
    "name": "Теле-тато у відставці, 3 сезон, 12 с",
    "time": "2024-10-02T03:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2445,
    "name": "Прибулець, 2 сезон, 8 с",
    "time": "2024-10-02T03:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2846,
    "name": "Загадка для Анни, 5 с",
    "time": "2024-10-02T02:55:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 2945,
    "name": "Щоденники Темного, 27 с",
    "time": "2024-10-02T02:30:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 2674,
    "name": "Одного разу під Полтавою, 3 сезон, 5 с",
    "time": "2024-10-02T02:25:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 3262,
    "name": "Зірконавти, 9 і 10 с",
    "time": "2024-10-02T02:15:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 2802,
    "name": "Брод Сіті, 1 сезон, 4 с",
    "time": "2024-10-02T02:05:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2845,
    "name": "Загадка для Анни, 4 с",
    "time": "2024-10-02T02:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 4100,
    "name": "Одного разу під Полтавою, 3 сезон, 18 с",
    "time": "2024-10-02T02:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 4296,
    "name": "CSI: Місце злочину - Маямі, 5 сезон, 21 і 22 с",
    "time": "2024-10-02T01:50:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 2564,
    "name": "Брод Сіті, 1 сезон, 3 с",
    "time": "2024-10-02T01:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 2639,
    "name": "Агенти справедливості, 5 сезон, 53 с. Проклятий автобус",
    "time": "2024-10-02T00:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 4336,
    "name": "Одного разу під Полтавою, 15 сезон, 20 с",
    "time": "2024-10-02T00:55:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2393,
    "name": "Чак, 3 сезон, 19 с",
    "time": "2024-10-02T00:35:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 4384,
    "name": "Медіум, 6 сезон, 20 с",
    "time": "2024-10-02T00:30:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 3272,
    "name": "Південний парк, 2 сезон, 14 с",
    "time": "2024-10-02T00:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2671,
    "name": "Одного разу під Полтавою, 15 сезон, 19 с",
    "time": "2024-10-02T00:15:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 4084,
    "name": "Шпигуни-союзники, 2 ч",
    "time": "2024-10-02T00:10:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 2606,
    "name": "Виходьте без дзвінка, 3 сезон, 18 с. Краса вимагає жертв",
    "time": "2024-10-02T00:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 3034,
    "name": "Південний парк, 2 сезон, 13 с",
    "time": "2024-10-02T00:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 2438,
    "name": "Королі палат, 14 с",
    "time": "2024-10-01T23:55:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 2427,
    "name": "Касл, 7 сезон, 3 і 4 с",
    "time": "2024-10-01T23:15:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 2469,
    "name": "Щоденники Темного, 25 с",
    "time": "2024-10-01T22:20:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 2370,
    "name": "Виходьте без дзвінка, 3 сезон, 19 с. Ансамбль танцю і смерті",
    "time": "2024-10-01T22:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 108,
    "name": "Агенти справедливості, 5 сезон, 52 с. Сейф",
    "time": "2024-10-01T20:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 123,
    "name": "Шпигуни-союзники, 1 ч",
    "time": "2024-10-01T20:40:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 57,
    "name": "Південний парк, 2 сезон, 12 с",
    "time": "2024-10-01T20:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 155,
    "name": "Волонтери, 2 с",
    "time": "2024-10-01T20:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 56,
    "name": "Південний парк, 2 сезон, 11 с",
    "time": "2024-10-01T20:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 80,
    "name": "Виходьте без дзвінка, 3 сезон, 17 с. Холодна страва",
    "time": "2024-10-01T20:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 11,
    "name": "Готель Галіція, 1 сезон, 5 і 6 с",
    "time": "2024-10-01T19:55:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 114,
    "name": "NCIS: Полювання на вбивцю, 8 сезон, 17 с",
    "time": "2024-10-01T19:55:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 107,
    "name": "Черговий лікар, 4 сезон, 8 с",
    "time": "2024-10-01T19:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 238,
    "name": "Поліцейські вертольотчики, 1 сезон, 10 с",
    "time": "2024-10-01T19:50:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 85,
    "name": "Доктор Хаус, 3 сезон, 24 с",
    "time": "2024-10-01T19:50:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 55,
    "name": "Південний парк, 2 сезон, 10 с",
    "time": "2024-10-01T19:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 54,
    "name": "Південний парк, 2 сезон, 9 с",
    "time": "2024-10-01T19:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 130,
    "name": "Евакуація, 1-4 с",
    "time": "2024-10-01T19:20:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 15,
    "name": "Фрейзер, 3 сезон, 17 с",
    "time": "2024-10-01T19:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 84,
    "name": "Доктор Хаус, 3 сезон, 23 с",
    "time": "2024-10-01T19:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 106,
    "name": "Черговий лікар, 4 сезон, 7 с",
    "time": "2024-10-01T18:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 179,
    "name": "Кістки, 10 сезон, 18-20 с",
    "time": "2024-10-01T18:45:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 79,
    "name": "Доньки-матері, 18 с",
    "time": "2024-10-01T18:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 89,
    "name": "Коло омани, 19 і 20 с",
    "time": "2024-10-01T18:00:00.000Z",
    "channel": "1+1 International",
    "type": "SERIES"
  },
  {
    "id": 122,
    "name": "Абсолютна влада",
    "time": "2024-10-01T18:00:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 230,
    "name": "Черкаси",
    "time": "2024-10-01T18:00:00.000Z",
    "channel": "Суспільне Культура",
    "type": "MOVIE"
  },
  {
    "id": 105,
    "name": "Квіти дощу, 4 с",
    "time": "2024-10-01T17:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 226,
    "name": "Обмін",
    "time": "2024-10-01T17:50:00.000Z",
    "channel": "Дом",
    "type": "MOVIE"
  },
  {
    "id": 78,
    "name": "Доньки-матері, 17 с",
    "time": "2024-10-01T17:30:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 129,
    "name": "Ворон та Воробйов, 11 і 12 с",
    "time": "2024-10-01T17:15:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 104,
    "name": "Квіти дощу, 3 с",
    "time": "2024-10-01T17:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 160,
    "name": "Мангровий гай, 2 с",
    "time": "2024-10-01T17:00:00.000Z",
    "channel": "К2",
    "type": "MOVIE"
  },
  {
    "id": 178,
    "name": "Медіум, 6 сезон, 18 і 19 с",
    "time": "2024-10-01T17:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 77,
    "name": "Доньки-матері, 16 с",
    "time": "2024-10-01T17:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 218,
    "name": "Нескорені міста",
    "time": "2024-10-01T16:30:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 192,
    "name": "Робокар Полі",
    "time": "2024-10-01T16:30:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 76,
    "name": "Доньки-матері, 15 с",
    "time": "2024-10-01T16:25:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 212,
    "name": "Велике шоу малюка акули",
    "time": "2024-10-01T16:10:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 75,
    "name": "Доньки-матері, 14 с",
    "time": "2024-10-01T16:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 8,
    "name": "Джек і Лондон, 3 і 4 с",
    "time": "2024-10-01T16:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 74,
    "name": "Доньки-матері, 13 с",
    "time": "2024-10-01T15:25:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 229,
    "name": "Центральна лікарня, 18 і 19 с",
    "time": "2024-10-01T15:25:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 96,
    "name": "Коп із минулого 2, 1-4 с",
    "time": "2024-10-01T15:00:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 73,
    "name": "Доньки-матері, 12 с",
    "time": "2024-10-01T15:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 88,
    "name": "Опер за викликом, 4 сезон, 7 і 8 с",
    "time": "2024-10-01T14:55:00.000Z",
    "channel": "1+1 International",
    "type": "SERIES"
  },
  {
    "id": 103,
    "name": "Слід. Сіра миша",
    "time": "2024-10-01T14:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 150,
    "name": "Лицар дня",
    "time": "2024-10-01T14:30:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 72,
    "name": "Доньки-матері, 11 с",
    "time": "2024-10-01T14:25:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 45,
    "name": "Король Квінса, 1 сезон, 5 с",
    "time": "2024-10-01T14:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 128,
    "name": "Стій! Бо моя мама стрілятиме",
    "time": "2024-10-01T14:10:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 71,
    "name": "Доньки-матері, 10 с",
    "time": "2024-10-01T14:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 102,
    "name": "Слід. Квартирне питання",
    "time": "2024-10-01T14:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 81,
    "name": "Метод Булла, 5 сезон, 13 с",
    "time": "2024-10-01T13:55:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 44,
    "name": "Король Квінса, 1 сезон, 4 с",
    "time": "2024-10-01T13:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 228,
    "name": "Обручка з рубіном, 38 і 39 с",
    "time": "2024-10-01T13:40:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 177,
    "name": "Інспектор Алекс, 10 сезон, 10-13 с",
    "time": "2024-10-01T13:35:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 149,
    "name": "Дієта №0, 10 с",
    "time": "2024-10-01T13:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 70,
    "name": "Доньки-матері, 9 с",
    "time": "2024-10-01T13:30:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 69,
    "name": "Доньки-матері, 8 с",
    "time": "2024-10-01T13:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 170,
    "name": "Постукай в мої двері",
    "time": "2024-10-01T13:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 95,
    "name": "Позивний Бандерас",
    "time": "2024-10-01T12:45:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 111,
    "name": "NCIS: Полювання на вбивцю, 11 сезон, 21 і 22 с",
    "time": "2024-10-01T12:35:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 148,
    "name": "Дієта №0, 9 с",
    "time": "2024-10-01T12:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 68,
    "name": "Доньки-матері, 7 с",
    "time": "2024-10-01T12:30:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 40,
    "name": "Шоу Рена та Стімпі, 1 сезон, 2 с",
    "time": "2024-10-01T12:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 127,
    "name": "Загублений світ",
    "time": "2024-10-01T12:10:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 87,
    "name": "Нове життя Василини Павлівни, 1-4 с",
    "time": "2024-10-01T12:10:00.000Z",
    "channel": "1+1 International",
    "type": "SERIES"
  },
  {
    "id": 120,
    "name": "Самаритянин",
    "time": "2024-10-01T12:10:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 67,
    "name": "Доньки-матері, 6 с",
    "time": "2024-10-01T12:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 39,
    "name": "Губка Боб Квадратні Штани, 1 сезон, 2 с",
    "time": "2024-10-01T11:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 66,
    "name": "Доньки-матері, 5 с",
    "time": "2024-10-01T11:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 65,
    "name": "Доньки-матері, 4 с",
    "time": "2024-10-01T11:10:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 233,
    "name": "Гаряча точка, 5 сезон, 1 с",
    "time": "2024-10-01T11:05:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 185,
    "name": "Майстерня Бібі",
    "time": "2024-10-01T11:00:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 227,
    "name": "Земля вовків, 3 сезон, 5 і 6 с",
    "time": "2024-10-01T11:00:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 176,
    "name": "Кістки, 10 сезон, 15-17 с",
    "time": "2024-10-01T10:50:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 94,
    "name": "Червоний",
    "time": "2024-10-01T10:35:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 64,
    "name": "Доньки-матері, 3 с",
    "time": "2024-10-01T10:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 146,
    "name": "Усі жінки - відьми, 4 сезон, 13 с",
    "time": "2024-10-01T10:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 232,
    "name": "Гаряча точка, 4 сезон, 18 с",
    "time": "2024-10-01T10:15:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 63,
    "name": "Доньки-матері, 2 с",
    "time": "2024-10-01T10:10:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 109,
    "name": "Гаваї 5.0, 7 сезон, 3 і 4 с",
    "time": "2024-10-01T10:00:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 119,
    "name": "Прибрати Картера",
    "time": "2024-10-01T10:00:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 175,
    "name": "Медіум, 6 сезон, 17 с",
    "time": "2024-10-01T10:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 62,
    "name": "Доньки-матері, 1 с",
    "time": "2024-10-01T09:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 118,
    "name": "Форма води",
    "time": "2024-10-01T07:40:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 93,
    "name": "CSI: Місце злочину - Маямі, 5 сезон, 22-24 с",
    "time": "2024-10-01T07:40:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 32,
    "name": "Король Квінса, 3 сезон, 2 с",
    "time": "2024-10-01T07:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 31,
    "name": "Король Квінса, 3 сезон, 1 с",
    "time": "2024-10-01T06:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 143,
    "name": "Біла змія",
    "time": "2024-10-01T06:30:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 30,
    "name": "Король Квінса, 2 сезон, 25 с",
    "time": "2024-10-01T06:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 126,
    "name": "Касл, 7 сезон, 9-11 с",
    "time": "2024-10-01T06:20:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 101,
    "name": "Комісар Рекс, 5 сезон, 2 с",
    "time": "2024-10-01T06:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 6,
    "name": "Одного разу під Полтавою, 151 і 152 с",
    "time": "2024-10-01T05:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 100,
    "name": "Комісар Рекс, 5 сезон, 1 с",
    "time": "2024-10-01T05:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 26,
    "name": "Фрейзер, 3 сезон, 13 с",
    "time": "2024-10-01T04:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 125,
    "name": "Касл, 7 сезон, 4 і 5 с",
    "time": "2024-10-01T04:40:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 25,
    "name": "Беккер, 4 сезон, 7 с",
    "time": "2024-10-01T04:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 99,
    "name": "Комісар Рекс, 4 сезон, 18 с",
    "time": "2024-10-01T04:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 24,
    "name": "Беккер, 4 сезон, 6 с",
    "time": "2024-10-01T03:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 141,
    "name": "Прибулець, 2 сезон, 7 с",
    "time": "2024-10-01T03:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 22,
    "name": "Теле-тато у відставці, 3 сезон, 10 с",
    "time": "2024-10-01T03:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 174,
    "name": "Село на мільйон, 2 сезон, 9 і 10 с",
    "time": "2024-10-01T03:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 5,
    "name": "Одного разу під Полтавою, 111 і 112 с",
    "time": "2024-10-01T02:55:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 139,
    "name": "Одного разу під Полтавою, 3 сезон, 1 с",
    "time": "2024-10-01T02:10:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 157,
    "name": "Девушка из зелёной долины, 1 і 2 с",
    "time": "2024-10-01T01:30:00.000Z",
    "channel": "К1",
    "type": "SERIES"
  },
  {
    "id": 136,
    "name": "Одного разу під Полтавою, 3 сезон, 4 с",
    "time": "2024-10-01T00:50:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 90,
    "name": "Чак, 3 сезон, 17 і 18 с",
    "time": "2024-10-01T00:40:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 4,
    "name": "Одного разу під Полтавою, 223 і 224 с",
    "time": "2024-10-01T00:30:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 168,
    "name": "Хамелеон, 2 с",
    "time": "2024-10-01T00:15:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 61,
    "name": "Загадка для Анни, 3 с",
    "time": "2024-10-01T00:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 156,
    "name": "Девушка из зелёной долины, 5 і 6 с",
    "time": "2024-10-01T00:00:00.000Z",
    "channel": "К1",
    "type": "SERIES"
  },
  {
    "id": 3,
    "name": "Зірконавти, 7 і 8 с",
    "time": "2024-09-30T23:20:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 60,
    "name": "Загадка для Анни, 2 с",
    "time": "2024-09-30T23:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 17,
    "name": "Брод Сіті, 1 сезон, 2 с",
    "time": "2024-09-30T23:05:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 91,
    "name": "CSI: Місце злочину - Маямі, 5 сезон, 19 і 20 с",
    "time": "2024-09-30T23:00:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 180,
    "name": "Останній гейм",
    "time": "2024-09-30T23:00:00.000Z",
    "channel": "Enter-фільм",
    "type": "MOVIE"
  },
  {
    "id": 98,
    "name": "Агенти справедливості, 5 сезон, 43 с. Зграя",
    "time": "2024-09-30T22:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 165,
    "name": "Щоденники Темного, 24 с",
    "time": "2024-09-30T22:45:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 16,
    "name": "Брод Сіті, 1 сезон, 1 с",
    "time": "2024-09-30T22:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 133,
    "name": "Одного разу під Полтавою, 3 сезон, 17 с",
    "time": "2024-09-30T22:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 59,
    "name": "Виходьте без дзвінка, 3 сезон, 16 с. Алаверди",
    "time": "2024-09-30T22:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 97,
    "name": "Агенти справедливості, 5 сезон, 51 с. Карта памяті",
    "time": "2024-09-30T21:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 124,
    "name": "Касл, 7 сезон, 1 і 2 с",
    "time": "2024-09-30T21:50:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 173,
    "name": "Медіум, 6 сезон, 18 с",
    "time": "2024-09-30T21:30:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 132,
    "name": "Одного разу під Полтавою, 15 сезон, 18 с",
    "time": "2024-09-30T21:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 13,
    "name": "Південний парк, 2 сезон, 8 с",
    "time": "2024-09-30T21:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 116,
    "name": "Шпигунські ігри, 2 ч",
    "time": "2024-09-30T21:10:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 58,
    "name": "Виходьте без дзвінка, 3 сезон, 15 с. Фото на память",
    "time": "2024-09-30T21:10:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 12,
    "name": "Південний парк, 2 сезон, 7 с",
    "time": "2024-09-30T21:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 131,
    "name": "Одного разу під Полтавою, 15 сезон, 17 с",
    "time": "2024-09-30T21:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 336,
    "name": "Агенти справедливості, 5 сезон, 50 с. Похмілля на Одеській трасі",
    "time": "2024-09-30T20:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 314,
    "name": "Метод Булла, 5 сезон, 12 с",
    "time": "2024-09-30T20:50:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 293,
    "name": "Південний парк, 2 сезон, 6 с",
    "time": "2024-09-30T20:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 377,
    "name": "Зозулі, 16 с",
    "time": "2024-09-30T20:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 292,
    "name": "Південний парк, 2 сезон, 5 с",
    "time": "2024-09-30T20:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 376,
    "name": "Зозулі, 15 с",
    "time": "2024-09-30T20:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 412,
    "name": "Баранчик Шон",
    "time": "2024-09-30T20:00:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 351,
    "name": "Шпигунські ігри, 1 ч",
    "time": "2024-09-30T20:00:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 313,
    "name": "Доктор Хаус, 3 сезон, 22 с",
    "time": "2024-09-30T19:55:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 335,
    "name": "Черговий лікар, 4 сезон, 6 с",
    "time": "2024-09-30T19:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 246,
    "name": "Готель Галіція, 1 сезон, 3 і 4 с",
    "time": "2024-09-30T19:55:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 343,
    "name": "NCIS: Полювання на вбивцю, 8 сезон, 16 с",
    "time": "2024-09-30T19:55:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 448,
    "name": "Уряд",
    "time": "2024-09-30T19:45:00.000Z",
    "channel": "Еко ТV",
    "type": "SERIES"
  },
  {
    "id": 291,
    "name": "Південний парк, 2 сезон, 4 с",
    "time": "2024-09-30T19:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 290,
    "name": "Південний парк, 2 сезон, 3 с",
    "time": "2024-09-30T19:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 354,
    "name": "Дочка генерала",
    "time": "2024-09-30T19:20:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 462,
    "name": "Культовий вбивця",
    "time": "2024-09-30T19:00:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "MOVIE"
  },
  {
    "id": 312,
    "name": "Доктор Хаус, 3 сезон, 21 с",
    "time": "2024-09-30T19:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 374,
    "name": "Волонтери, 1 с",
    "time": "2024-09-30T19:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 334,
    "name": "Черговий лікар, 4 сезон, 5 с",
    "time": "2024-09-30T18:50:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 404,
    "name": "Кістки, 10 сезон, 16-18 с",
    "time": "2024-09-30T18:45:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 397,
    "name": "Заборонений плід, 423 с",
    "time": "2024-09-30T18:45:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 267,
    "name": "Фрейзер, 3 сезон, 14 с",
    "time": "2024-09-30T18:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 317,
    "name": "Коло омани, 17 і 18 с",
    "time": "2024-09-30T18:00:00.000Z",
    "channel": "1+1 International",
    "type": "SERIES"
  },
  {
    "id": 350,
    "name": "Найманець",
    "time": "2024-09-30T18:00:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 311,
    "name": "Жіночий лікар. Нове життя 2, 33 с",
    "time": "2024-09-30T18:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 244,
    "name": "Одного разу під Полтавою, 189 і 190 с",
    "time": "2024-09-30T17:55:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 333,
    "name": "Квіти дощу, 2 с",
    "time": "2024-09-30T17:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 396,
    "name": "Заборонений плід, 422 с",
    "time": "2024-09-30T17:50:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 439,
    "name": "Еббі Хетчер",
    "time": "2024-09-30T17:35:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 287,
    "name": "Король Квінса, 1 сезон, 3 с",
    "time": "2024-09-30T17:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 353,
    "name": "Ворон та Воробйов, 9 і 10 с",
    "time": "2024-09-30T17:15:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 325,
    "name": "Коп із минулого 2, 1 і 2 с",
    "time": "2024-09-30T17:00:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 403,
    "name": "Медіум, 6 сезон, 16 і 17 с",
    "time": "2024-09-30T17:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 310,
    "name": "Жіночий лікар. Нове життя 2, 32 с",
    "time": "2024-09-30T17:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 395,
    "name": "Заборонений плід, 421 с",
    "time": "2024-09-30T17:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 332,
    "name": "Квіти дощу, 1 с",
    "time": "2024-09-30T17:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 381,
    "name": "Мангровий гай, 1 с",
    "time": "2024-09-30T17:00:00.000Z",
    "channel": "К2",
    "type": "MOVIE"
  },
  {
    "id": 286,
    "name": "Правила спільного життя, 2 сезон, 6 с",
    "time": "2024-09-30T16:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 373,
    "name": "Бамблбі",
    "time": "2024-09-30T16:45:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 459,
    "name": "Гаряча точка, 4 сезон, 17 с",
    "time": "2024-09-30T16:30:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 272,
    "name": "Правила спільного життя, 2 сезон, 5 с",
    "time": "2024-09-30T16:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 394,
    "name": "Крила кохання, 153 с",
    "time": "2024-09-30T16:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 243,
    "name": "Джек і Лондон, 1 і 2 с",
    "time": "2024-09-30T16:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 455,
    "name": "Центральна лікарня, 17 і 18 с",
    "time": "2024-09-30T15:30:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 380,
    "name": "Криваві квіти, 41 і 42 с",
    "time": "2024-09-30T15:20:00.000Z",
    "channel": "К2",
    "type": "SERIES"
  },
  {
    "id": 283,
    "name": "Беккер, 4 сезон, 10 с",
    "time": "2024-09-30T15:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 324,
    "name": "Коп із минулого, 15 і 16 с",
    "time": "2024-09-30T15:05:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 393,
    "name": "Крила кохання, 152 с",
    "time": "2024-09-30T15:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 331,
    "name": "Слід. Життя та смерть Вітаса",
    "time": "2024-09-30T14:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 316,
    "name": "Опер за викликом, 4 сезон, 5 і 6 с",
    "time": "2024-09-30T14:50:00.000Z",
    "channel": "1+1 International",
    "type": "SERIES"
  },
  {
    "id": 427,
    "name": "Елвін і бурундуки",
    "time": "2024-09-30T14:25:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 383,
    "name": "CSI: Місце злочину",
    "time": "2024-09-30T14:20:00.000Z",
    "channel": "Сонце",
    "type": "SERIES"
  },
  {
    "id": 281,
    "name": "Король Квінса, 1 сезон, 2 с",
    "time": "2024-09-30T14:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 309,
    "name": "Метод Булла, 5 сезон, 11 с",
    "time": "2024-09-30T13:55:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 330,
    "name": "Слід. Вакцина щастя",
    "time": "2024-09-30T13:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 280,
    "name": "Король Квінса, 1 сезон, 1 с",
    "time": "2024-09-30T13:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 454,
    "name": "Обручка з рубіном, 37 і 38 с",
    "time": "2024-09-30T13:40:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 402,
    "name": "Інспектор Алекс, 10 сезон, 6-9 с",
    "time": "2024-09-30T13:35:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 302,
    "name": "Виходьте без дзвінка, 3 сезон, 28 с. Втрата контролю",
    "time": "2024-09-30T13:30:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 323,
    "name": "Одного разу в Мексиці: Відчайдушний 2",
    "time": "2024-09-30T13:05:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 308,
    "name": "Метод Булла, 5 сезон, 10 с",
    "time": "2024-09-30T13:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 340,
    "name": "NCIS: Полювання на вбивцю, 11 сезон, 19 і 20 с",
    "time": "2024-09-30T12:35:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 277,
    "name": "Правила спільного життя, 2 сезон, 7 с",
    "time": "2024-09-30T12:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 301,
    "name": "Виходьте без дзвінка, 3 сезон, 27 с. У банці з павуками",
    "time": "2024-09-30T12:30:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 315,
    "name": "Королі палат, 17-20 с",
    "time": "2024-09-30T12:20:00.000Z",
    "channel": "1+1 International",
    "type": "SERIES"
  },
  {
    "id": 276,
    "name": "Шоу Рена та Стімпі, 1 сезон, 1 с",
    "time": "2024-09-30T12:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 370,
    "name": "Дієта №0, 8 с",
    "time": "2024-09-30T12:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 348,
    "name": "Руйнівник",
    "time": "2024-09-30T11:50:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 275,
    "name": "Губка Боб Квадратні Штани, 1 сезон, 1 с",
    "time": "2024-09-30T11:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 369,
    "name": "Усі жінки - відьми, 4 сезон, 12 с",
    "time": "2024-09-30T11:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 322,
    "name": "Праведник 3: Остання глава",
    "time": "2024-09-30T10:55:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 453,
    "name": "Земля вовків, 3 сезон, 4 і 5 с",
    "time": "2024-09-30T10:50:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 401,
    "name": "Кістки, 10 сезон, 13-15 с",
    "time": "2024-09-30T10:50:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 274,
    "name": "Усі ненавидять Кріса, 1 сезон, 14 с",
    "time": "2024-09-30T10:30:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 273,
    "name": "Усі ненавидять Кріса, 1 сезон, 13 с",
    "time": "2024-09-30T10:05:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 338,
    "name": "Гаваї 5.0, 7 сезон, 1 і 2 с",
    "time": "2024-09-30T10:00:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 400,
    "name": "Медіум, 6 сезон, 15 с",
    "time": "2024-09-30T10:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 368,
    "name": "Усі жінки - відьми, 4 сезон, 11 с",
    "time": "2024-09-30T10:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 347,
    "name": "Кобра",
    "time": "2024-09-30T09:55:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 434,
    "name": "Бебі Борн",
    "time": "2024-09-30T09:45:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 456,
    "name": "Гаряча точка, 4 сезон, 14 с",
    "time": "2024-09-30T09:20:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 271,
    "name": "Правила спільного життя, 2 сезон, 4 с",
    "time": "2024-09-30T09:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 452,
    "name": "Хадсон і Рекс, 53 с",
    "time": "2024-09-30T09:00:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 367,
    "name": "Усі жінки - відьми, 4 сезон, 10 с",
    "time": "2024-09-30T09:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 321,
    "name": "CSI: Місце злочину - Маямі, 5 сезон, 19-21 с",
    "time": "2024-09-30T08:10:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 366,
    "name": "Усі жінки - відьми, 4 сезон, 9 с",
    "time": "2024-09-30T08:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 346,
    "name": "Міс Бала",
    "time": "2024-09-30T07:55:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 266,
    "name": "Король Квінса, 2 сезон, 24 с",
    "time": "2024-09-30T07:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 450,
    "name": "Припутні",
    "time": "2024-09-30T07:05:00.000Z",
    "channel": "Дом",
    "type": "MOVIE"
  },
  {
    "id": 265,
    "name": "Король Квінса, 2 сезон, 23 с",
    "time": "2024-09-30T06:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 264,
    "name": "Король Квінса, 2 сезон, 22 с",
    "time": "2024-09-30T06:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 364,
    "name": "Дівчинка з сірниками",
    "time": "2024-09-30T06:00:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 263,
    "name": "Усі ненавидять Кріса, 1 сезон, 12 с",
    "time": "2024-09-30T05:55:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 329,
    "name": "Комісар Рекс, 4 сезон, 17 с",
    "time": "2024-09-30T05:50:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 337,
    "name": "9-1-1",
    "time": "2024-09-30T05:45:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 262,
    "name": "Усі ненавидять Кріса, 1 сезон, 11 с",
    "time": "2024-09-30T05:30:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 379,
    "name": "Криваві квіти, 39 і 40 с",
    "time": "2024-09-30T05:20:00.000Z",
    "channel": "К2",
    "type": "SERIES"
  },
  {
    "id": 241,
    "name": "Одного разу під Полтавою, 149 і 150 с",
    "time": "2024-09-30T05:05:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 261,
    "name": "Фрейзер, 3 сезон, 12 с",
    "time": "2024-09-30T05:05:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 328,
    "name": "Комісар Рекс, 4 сезон, 16 с",
    "time": "2024-09-30T04:50:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 352,
    "name": "Ворон та Воробйов, 1-8 с",
    "time": "2024-09-30T04:45:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 260,
    "name": "Фрейзер, 3 сезон, 11 с",
    "time": "2024-09-30T04:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 259,
    "name": "Беккер, 4 сезон, 5 с",
    "time": "2024-09-30T04:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 258,
    "name": "Беккер, 4 сезон, 4 с",
    "time": "2024-09-30T03:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 327,
    "name": "Комісар Рекс, 4 сезон, 15 с",
    "time": "2024-09-30T03:50:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 363,
    "name": "Прибулець, 2 сезон, 6 с",
    "time": "2024-09-30T03:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 257,
    "name": "Теле-тато у відставці, 3 сезон, 7 с",
    "time": "2024-09-30T03:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 399,
    "name": "Село на мільйон, 2 сезон, 7 і 8 с",
    "time": "2024-09-30T03:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 362,
    "name": "Прибулець, 2 сезон, 5 с",
    "time": "2024-09-30T03:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 256,
    "name": "Теле-тато у відставці, 3 сезон, 6 с",
    "time": "2024-09-30T03:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 240,
    "name": "Одного разу під Полтавою, 109 і 110 с",
    "time": "2024-09-30T03:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 255,
    "name": "Теле-тато у відставці, 1 сезон, 20 с",
    "time": "2024-09-30T02:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 239,
    "name": "Одного разу під Полтавою, 284 с",
    "time": "2024-09-30T02:30:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 254,
    "name": "Теле-тато у відставці, 1 сезон, 19 с",
    "time": "2024-09-30T02:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 360,
    "name": "Одного разу під Полтавою, 14 сезон, 11 с",
    "time": "2024-09-30T02:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 298,
    "name": "Загадка для Анни, 1 с",
    "time": "2024-09-30T01:15:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 359,
    "name": "Одного разу під Полтавою, 3 сезон, 12 с",
    "time": "2024-09-30T01:05:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 358,
    "name": "Одного разу під Полтавою, 3 сезон, 16 с",
    "time": "2024-09-30T00:40:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 297,
    "name": "Майже одружені, 20 с",
    "time": "2024-09-30T00:20:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 389,
    "name": "Хамелеон, 1 с",
    "time": "2024-09-30T00:15:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 378,
    "name": "Девушка из зелёной долины, 1-4 с",
    "time": "2024-09-30T00:00:00.000Z",
    "channel": "К1",
    "type": "SERIES"
  },
  {
    "id": 253,
    "name": "Ріно 911!, 3 сезон, 7 с",
    "time": "2024-09-29T23:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 326,
    "name": "Слід. Материнське прокляття",
    "time": "2024-09-29T23:45:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 296,
    "name": "Майже одружені, 16 с",
    "time": "2024-09-29T23:25:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 252,
    "name": "Ріно 911!, 3 сезон, 6 с",
    "time": "2024-09-29T23:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 356,
    "name": "Одного разу під Полтавою, 3 сезон, 15 с",
    "time": "2024-09-29T23:20:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 251,
    "name": "Ріно 911!, 3 сезон, 5 с",
    "time": "2024-09-29T23:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 405,
    "name": "Золотий ланцюг",
    "time": "2024-09-29T23:00:00.000Z",
    "channel": "Enter-фільм",
    "type": "MOVIE"
  },
  {
    "id": 319,
    "name": "Два з половиною чоловіки, 3 сезон, 19-22 с",
    "time": "2024-09-29T22:40:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 250,
    "name": "Ріно 911!, 3 сезон, 4 с",
    "time": "2024-09-29T22:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 295,
    "name": "Майже одружені, 19 с",
    "time": "2024-09-29T22:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 386,
    "name": "Щоденники Темного, 23 с",
    "time": "2024-09-29T22:30:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 355,
    "name": "Одного разу під Полтавою, 14 сезон, 16 с",
    "time": "2024-09-29T22:25:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 249,
    "name": "Південний парк, 6 сезон, 1 с",
    "time": "2024-09-29T22:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 385,
    "name": "Щоденники Темного, 22 с",
    "time": "2024-09-29T21:55:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 248,
    "name": "Південний парк, 5 сезон, 14 с",
    "time": "2024-09-29T21:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 294,
    "name": "Майже одружені, 15 с",
    "time": "2024-09-29T21:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 398,
    "name": "Словяни, 11 і 12 с",
    "time": "2024-09-29T21:30:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 247,
    "name": "Південний парк, 5 сезон, 13 с",
    "time": "2024-09-29T21:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 318,
    "name": "Бачення метелика, 2 ч",
    "time": "2024-09-29T21:10:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 451,
    "name": "Демон-коханець",
    "time": "2024-09-29T21:00:00.000Z",
    "channel": "Суспільне Культура",
    "type": "MOVIE"
  },
  {
    "id": 511,
    "name": "Південний парк, 5 сезон, 4 с",
    "time": "2024-09-28T20:55:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 565,
    "name": "ЖК Сімейки, 7 с",
    "time": "2024-09-28T20:50:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 535,
    "name": "Агенти справедливості, 1 сезон, 3 с. Утоплениці",
    "time": "2024-09-28T20:50:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 510,
    "name": "Південний парк, 5 сезон, 2 с",
    "time": "2024-09-28T20:30:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 543,
    "name": "Топ Ган: Меверік",
    "time": "2024-09-28T20:30:00.000Z",
    "channel": "1+1 Україна",
    "type": "MOVIE"
  },
  {
    "id": 509,
    "name": "Південний парк, 5 сезон, 1 с",
    "time": "2024-09-28T20:05:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 534,
    "name": "Агенти справедливості, 1 сезон, 2 с. Жорстока розправа",
    "time": "2024-09-28T19:55:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 576,
    "name": "Елементарно",
    "time": "2024-09-28T19:40:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 508,
    "name": "Південний парк, 4 сезон, 11 с",
    "time": "2024-09-28T19:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 633,
    "name": "Космічний старт",
    "time": "2024-09-28T19:30:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 554,
    "name": "Скарб Амазонки, 1 ч",
    "time": "2024-09-28T19:25:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 507,
    "name": "Південний парк, 4 сезон, 8 с",
    "time": "2024-09-28T19:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 533,
    "name": "Агенти справедливості, 1 сезон, 1 с. Розплата за любов",
    "time": "2024-09-28T19:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 632,
    "name": "Бейблейд X",
    "time": "2024-09-28T19:00:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 654,
    "name": "Диностер",
    "time": "2024-09-28T18:50:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 622,
    "name": "Кістки, 10 сезон, 12-14 с",
    "time": "2024-09-28T18:45:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 584,
    "name": "Війна майбутнього",
    "time": "2024-09-28T18:30:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 542,
    "name": "Перлина Нілу",
    "time": "2024-09-28T18:10:00.000Z",
    "channel": "1+1 Україна",
    "type": "MOVIE"
  },
  {
    "id": 532,
    "name": "Агенти справедливості, 4 сезон, 40 с. Чорний список",
    "time": "2024-09-28T18:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 506,
    "name": "Фрейзер, 2 сезон, 10 с",
    "time": "2024-09-28T18:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 590,
    "name": "Форсаж 8",
    "time": "2024-09-28T17:45:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 505,
    "name": "Фрейзер, 2 сезон, 9 с",
    "time": "2024-09-28T17:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 504,
    "name": "Фрейзер, 2 сезон, 8 с",
    "time": "2024-09-28T17:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 685,
    "name": "Пригоди Мерліна, 4 сезон, 1 с",
    "time": "2024-09-28T17:05:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 553,
    "name": "Незвідане",
    "time": "2024-09-28T17:05:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 636,
    "name": "Бджілка Майя",
    "time": "2024-09-28T17:00:00.000Z",
    "channel": "Піксель",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 531,
    "name": "Агенти справедливості, 4 сезон, 39 с. Мисливець",
    "time": "2024-09-28T17:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 503,
    "name": "Фрейзер, 2 сезон, 7 с",
    "time": "2024-09-28T16:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 482,
    "name": "Фрейзер, 2 сезон, 6 с",
    "time": "2024-09-28T16:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 606,
    "name": "Місія неможлива: Наслідки",
    "time": "2024-09-28T16:15:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 671,
    "name": "Брати. Остання сповідь",
    "time": "2024-09-28T16:15:00.000Z",
    "channel": "Дом",
    "type": "MOVIE"
  },
  {
    "id": 684,
    "name": "Пригоди Мерліна, 3 сезон, 13 с",
    "time": "2024-09-28T16:10:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 530,
    "name": "Агенти справедливості, 4 сезон, 38 с. Ілюзія правди",
    "time": "2024-09-28T16:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 662,
    "name": "Герої золотих масок",
    "time": "2024-09-28T16:00:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON"
  },
  {
    "id": 608,
    "name": "Сімейний консультант, 6 с",
    "time": "2024-09-28T16:00:00.000Z",
    "channel": "К2",
    "type": "SERIES"
  },
  {
    "id": 583,
    "name": "На межі майбутнього",
    "time": "2024-09-28T16:00:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 541,
    "name": "Роман з каменем",
    "time": "2024-09-28T16:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "MOVIE"
  },
  {
    "id": 502,
    "name": "Усі ненавидять Кріса, 2 сезон, 6 с",
    "time": "2024-09-28T15:55:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 674,
    "name": "Потяг, 1-4 с",
    "time": "2024-09-28T15:55:00.000Z",
    "channel": "Суспільне Культура",
    "type": "MOVIE"
  },
  {
    "id": 501,
    "name": "Усі ненавидять Кріса, 2 сезон, 5 с",
    "time": "2024-09-28T15:30:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 683,
    "name": "Пригоди Мерліна, 3 сезон, 12 с",
    "time": "2024-09-28T15:15:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 621,
    "name": "Зустрічна смуга, 10-13 с",
    "time": "2024-09-28T15:10:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 467,
    "name": "Одного разу під Полтавою, 281 і 282 с",
    "time": "2024-09-28T15:05:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 575,
    "name": "Слід. Баба-вогонь",
    "time": "2024-09-28T15:05:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 529,
    "name": "Агенти справедливості, 4 сезон, 37 с. У павутині брехні",
    "time": "2024-09-28T15:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 500,
    "name": "Усі ненавидять Кріса, 2 сезон, 4 с",
    "time": "2024-09-28T15:05:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 607,
    "name": "Сімейний консультант, 5 с",
    "time": "2024-09-28T15:00:00.000Z",
    "channel": "К2",
    "type": "SERIES"
  },
  {
    "id": 589,
    "name": "Форсаж 7",
    "time": "2024-09-28T15:00:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 540,
    "name": "Жіночий лікар. Нове життя 2, 28 с",
    "time": "2024-09-28T15:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 499,
    "name": "Усі ненавидять Кріса, 2 сезон, 3 с",
    "time": "2024-09-28T14:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 661,
    "name": "Упс! Пригода триває",
    "time": "2024-09-28T14:20:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON"
  },
  {
    "id": 682,
    "name": "Пригоди Мерліна, 3 сезон, 11 с",
    "time": "2024-09-28T14:20:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 498,
    "name": "Король Квінса, 2 сезон, 14 с",
    "time": "2024-09-28T14:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 466,
    "name": "Одного разу під Полтавою, 199 і 200 с",
    "time": "2024-09-28T14:05:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 528,
    "name": "Агенти справедливості, 4 сезон, 36 с. Неспростовні докази",
    "time": "2024-09-28T14:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 574,
    "name": "Слід. Небезпека рецидиву",
    "time": "2024-09-28T14:05:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 539,
    "name": "Жіночий лікар. Нове життя 2, 27 с",
    "time": "2024-09-28T14:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 544,
    "name": "Гроза над Тихоріччям, 1-4 с",
    "time": "2024-09-28T13:55:00.000Z",
    "channel": "1+1 International",
    "type": "MOVIE"
  },
  {
    "id": 582,
    "name": "Поліцейський із Беверлі-Гіллз 3",
    "time": "2024-09-28T13:55:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 497,
    "name": "Король Квінса, 2 сезон, 13 с",
    "time": "2024-09-28T13:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 681,
    "name": "Пригоди Мерліна, 3 сезон, 10 с",
    "time": "2024-09-28T13:35:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 620,
    "name": "Інспектор Алекс, 10 сезон, 2 і 3 с",
    "time": "2024-09-28T13:35:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 605,
    "name": "Місія неможлива: Нація ізгоїв",
    "time": "2024-09-28T13:30:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 496,
    "name": "Король Квінса, 2 сезон, 12 с",
    "time": "2024-09-28T13:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 573,
    "name": "Слід. Сталкер",
    "time": "2024-09-28T13:10:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 527,
    "name": "Агенти справедливості, 4 сезон, 35 с. Таємниця, що вбиває",
    "time": "2024-09-28T13:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 538,
    "name": "Жіночий лікар. Нове життя 2, 26 с",
    "time": "2024-09-28T13:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 495,
    "name": "Король Квінса, 2 сезон, 11 с",
    "time": "2024-09-28T13:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 673,
    "name": "Хадсон і Рекс, 49-52 с",
    "time": "2024-09-28T12:40:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 680,
    "name": "Пригоди Мерліна, 3 сезон, 9 с",
    "time": "2024-09-28T12:40:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 551,
    "name": "Праведник 2",
    "time": "2024-09-28T12:40:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 588,
    "name": "Скарб нації: Книга таємниць",
    "time": "2024-09-28T12:40:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 572,
    "name": "Слід. Майже англійське вбивство",
    "time": "2024-09-28T12:10:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 526,
    "name": "Агенти справедливості, 4 сезон, 33 с. Криваве весілля",
    "time": "2024-09-28T12:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 537,
    "name": "Жіночий лікар. Нове життя 2, 25 с",
    "time": "2024-09-28T12:00:00.000Z",
    "channel": "1+1 Україна",
    "type": "SERIES"
  },
  {
    "id": 616,
    "name": "Кохання проти долі",
    "time": "2024-09-28T12:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 581,
    "name": "Поліцейський із Беверлі-Гіллз 2",
    "time": "2024-09-28T11:50:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 679,
    "name": "Пригоди Мерліна, 3 сезон, 8 с",
    "time": "2024-09-28T11:45:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 604,
    "name": "101 далматинець",
    "time": "2024-09-28T11:30:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 571,
    "name": "Слід. Сліпа помста",
    "time": "2024-09-28T11:15:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 525,
    "name": "Агенти справедливості, 4 сезон, 32 с. Ідеальний донор",
    "time": "2024-09-28T11:05:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 619,
    "name": "Кістки, 10 сезон, 9-11 с",
    "time": "2024-09-28T10:50:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 678,
    "name": "Пригоди Мерліна, 3 сезон, 7 с",
    "time": "2024-09-28T10:50:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 570,
    "name": "Слід. Погані люди",
    "time": "2024-09-28T10:20:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 524,
    "name": "Агенти справедливості, 4 сезон, 31 с. Злочин з багатьма невідомими",
    "time": "2024-09-28T10:10:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 490,
    "name": "Беккер, 1 сезон, 4 с",
    "time": "2024-09-28T10:05:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 550,
    "name": "Праведник",
    "time": "2024-09-28T10:00:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 587,
    "name": "Скарб нації",
    "time": "2024-09-28T10:00:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 670,
    "name": "Пропала грамота",
    "time": "2024-09-28T09:55:00.000Z",
    "channel": "Дом",
    "type": "MOVIE"
  },
  {
    "id": 489,
    "name": "Беккер, 1 сезон, 3 с",
    "time": "2024-09-28T09:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 603,
    "name": "Сімейка Крудсів: Нова ера",
    "time": "2024-09-28T09:40:00.000Z",
    "channel": "ТЕТ",
    "type": "CARTOON"
  },
  {
    "id": 580,
    "name": "Поліцейський із Беверлі-Гіллз",
    "time": "2024-09-28T09:40:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 651,
    "name": "Блупіс",
    "time": "2024-09-28T09:30:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 569,
    "name": "Слід. Брудна справа",
    "time": "2024-09-28T09:20:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 488,
    "name": "Беккер, 1 сезон, 2 с",
    "time": "2024-09-28T09:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 523,
    "name": "Агенти справедливості, 4 сезон, 30 с. Найближче коло",
    "time": "2024-09-28T09:10:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 487,
    "name": "Беккер, 1 сезон, 1 с",
    "time": "2024-09-28T08:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 568,
    "name": "ЖК Сімейки, 1 с",
    "time": "2024-09-28T08:40:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 677,
    "name": "Американська зірка",
    "time": "2024-09-28T08:35:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "MOVIE"
  },
  {
    "id": 650,
    "name": "Свинка Пеппа",
    "time": "2024-09-28T08:30:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 486,
    "name": "Король Квінса, 2 сезон, 10 с",
    "time": "2024-09-28T08:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 649,
    "name": "Пес Патрон",
    "time": "2024-09-28T08:20:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 586,
    "name": "Робінзон Крузо",
    "time": "2024-09-28T08:10:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 522,
    "name": "Агенти справедливості, 4 сезон, 29 с. Кругова порука",
    "time": "2024-09-28T08:10:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 567,
    "name": "ЖК Сімейки, 4 с",
    "time": "2024-09-28T08:05:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 485,
    "name": "Король Квінса, 2 сезон, 9 с",
    "time": "2024-09-28T08:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 549,
    "name": "Меґ",
    "time": "2024-09-28T07:50:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 602,
    "name": "Родина Крудс",
    "time": "2024-09-28T07:50:00.000Z",
    "channel": "ТЕТ",
    "type": "CARTOON"
  },
  {
    "id": 536,
    "name": "Війна світів",
    "time": "2024-09-28T07:45:00.000Z",
    "channel": "1+1 Україна",
    "type": "MOVIE"
  },
  {
    "id": 484,
    "name": "Король Квінса, 2 сезон, 8 с",
    "time": "2024-09-28T07:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 566,
    "name": "ЖК Сімейки, 8 с",
    "time": "2024-09-28T07:35:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 521,
    "name": "Агенти справедливості, 4 сезон, 28 с. Не суди мене",
    "time": "2024-09-28T07:10:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 483,
    "name": "Король Квінса, 2 сезон, 7 с",
    "time": "2024-09-28T07:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 515,
    "name": "Агенти справедливості, 4 сезон, 27 с. Подвійна поразка",
    "time": "2024-09-28T06:15:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 672,
    "name": "Йосип Прекрасний: намісник фараона, 1 і 2 с",
    "time": "2024-09-28T06:05:00.000Z",
    "channel": "Суспільне Культура",
    "type": "MOVIE"
  },
  {
    "id": 601,
    "name": "Лоракс",
    "time": "2024-09-28T06:05:00.000Z",
    "channel": "ТЕТ",
    "type": "CARTOON"
  },
  {
    "id": 520,
    "name": "Агенти справедливості, 4 сезон, 26 с. Кривава прогулянка",
    "time": "2024-09-28T05:15:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 548,
    "name": "Джон Картер: Між двох світів",
    "time": "2024-09-28T05:05:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 564,
    "name": "Слід. Тонкий розрахунок",
    "time": "2024-09-28T04:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 481,
    "name": "Фрейзер, 2 сезон, 5 с",
    "time": "2024-09-28T04:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 600,
    "name": "Пригоди на місяці",
    "time": "2024-09-28T04:30:00.000Z",
    "channel": "ТЕТ",
    "type": "CARTOON"
  },
  {
    "id": 514,
    "name": "Агенти справедливості, 4 сезон, 24 с. Реквієм за довірою",
    "time": "2024-09-28T04:20:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 480,
    "name": "Фрейзер, 2 сезон, 4 с",
    "time": "2024-09-28T04:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 563,
    "name": "Слід. Двічі вбитий",
    "time": "2024-09-28T04:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 479,
    "name": "Фрейзер, 2 сезон, 3 с",
    "time": "2024-09-28T03:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 579,
    "name": "Кунґ-фу панда",
    "time": "2024-09-28T03:30:00.000Z",
    "channel": "Новий канал",
    "type": "CARTOON"
  },
  {
    "id": 667,
    "name": "Паризькі таємниці",
    "time": "2024-09-28T03:30:00.000Z",
    "channel": "5 канал",
    "type": "SERIES"
  },
  {
    "id": 478,
    "name": "Теле-тато у відставці, 1 сезон, 18 с",
    "time": "2024-09-28T03:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 519,
    "name": "Агенти справедливості, 4 сезон, 23 с. Небезпечний свідок",
    "time": "2024-09-28T03:20:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 465,
    "name": "Одного разу під Полтавою, 99-102 с",
    "time": "2024-09-28T03:05:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 618,
    "name": "Село на мільйон, 2 сезон, 3 і 4 с",
    "time": "2024-09-28T03:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 599,
    "name": "Двоє друзів та борсук",
    "time": "2024-09-28T03:00:00.000Z",
    "channel": "ТЕТ",
    "type": "CARTOON"
  },
  {
    "id": 477,
    "name": "Теле-тато у відставці, 1 сезон, 17 с",
    "time": "2024-09-28T03:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 598,
    "name": "Казка про білу крижинку",
    "time": "2024-09-28T02:55:00.000Z",
    "channel": "ТЕТ",
    "type": "CARTOON"
  },
  {
    "id": 597,
    "name": "Про кішку, яка впала з неба",
    "time": "2024-09-28T02:45:00.000Z",
    "channel": "ТЕТ",
    "type": "CARTOON"
  },
  {
    "id": 676,
    "name": "Поліцейські вертольотчики, 1 сезон, 8 с",
    "time": "2024-09-28T02:35:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 562,
    "name": "Слід. У пошуках майора",
    "time": "2024-09-28T02:35:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 518,
    "name": "Агенти справедливості, 4 сезон, 22 с. Ніч відкритих дверей",
    "time": "2024-09-28T02:35:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 475,
    "name": "Теле-тато у відставці, 3 сезон, 13 с",
    "time": "2024-09-28T02:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 596,
    "name": "Одного разу під Полтавою, 14 сезон, 13 с",
    "time": "2024-09-28T02:15:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 561,
    "name": "Слід. Смертельний танок, 2 ч",
    "time": "2024-09-28T02:05:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 560,
    "name": "Слід. Смертельний танок, 1 ч",
    "time": "2024-09-28T01:40:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 517,
    "name": "Агенти справедливості, 4 сезон, 21 с. Подвійний розрахунок",
    "time": "2024-09-28T01:40:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 595,
    "name": "Одного разу під Полтавою, 3 сезон, 11 с",
    "time": "2024-09-28T01:25:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 464,
    "name": "Одного разу під Полтавою, 222 с",
    "time": "2024-09-28T01:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 516,
    "name": "Агенти справедливості, 4 сезон, 20 с. Без терміну давності",
    "time": "2024-09-28T00:50:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 559,
    "name": "Слід. Красиве життя",
    "time": "2024-09-28T00:45:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 594,
    "name": "Одного разу під Полтавою, 3 сезон, 3 с",
    "time": "2024-09-28T00:25:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 614,
    "name": "Хамелеон, 23 с",
    "time": "2024-09-27T23:55:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 558,
    "name": "Слід. Ціна зради",
    "time": "2024-09-27T23:55:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 463,
    "name": "Зірконавти, 5 і 6 с",
    "time": "2024-09-27T23:35:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 546,
    "name": "Два з половиною чоловіки, 3 сезон, 13-15 с",
    "time": "2024-09-27T23:25:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 592,
    "name": "Одного разу під Полтавою, 14 сезон, 17 с",
    "time": "2024-09-27T23:05:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 557,
    "name": "Агенти справедливості, 5 сезон, 35 с. Приречений",
    "time": "2024-09-27T23:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 623,
    "name": "Таємниця Чингісхана",
    "time": "2024-09-27T23:00:00.000Z",
    "channel": "Enter-фільм",
    "type": "MOVIE"
  },
  {
    "id": 472,
    "name": "Брод Сіті, 4 сезон, 10 с",
    "time": "2024-09-27T22:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 471,
    "name": "Брод Сіті, 4 сезон, 9 с",
    "time": "2024-09-27T22:30:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 545,
    "name": "Вижити за будь-яку ціну, 3 сезон",
    "time": "2024-09-27T22:20:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 556,
    "name": "Агенти справедливості, 5 сезон, 49 с. Хвилина мовчання",
    "time": "2024-09-27T22:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 469,
    "name": "Фрейзер, 1 сезон, 21 с",
    "time": "2024-09-27T21:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 617,
    "name": "Медіум, 6 сезон, 16 с",
    "time": "2024-09-27T21:30:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 468,
    "name": "Південний парк, 5 сезон, 10 с",
    "time": "2024-09-27T21:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 578,
    "name": "Будинок воскових фігур, 2 ч",
    "time": "2024-09-27T21:10:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 555,
    "name": "Агенти справедливості, 5 сезон, 48 с. Самотній вовк",
    "time": "2024-09-27T21:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 774,
    "name": "Будинок воскових фігур, 1 ч",
    "time": "2024-09-27T20:50:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 731,
    "name": "Південний парк, 5 сезон, 9 с",
    "time": "2024-09-27T20:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 730,
    "name": "Південний парк, 5 сезон, 8 с",
    "time": "2024-09-27T20:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 744,
    "name": "Виходьте без дзвінка, 3 сезон, 14 с. Зірвана угода",
    "time": "2024-09-27T20:10:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 729,
    "name": "Південний парк, 5 сезон, 7 с",
    "time": "2024-09-27T20:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 694,
    "name": "Готель Галіція, 1 сезон, 1 і 2 с",
    "time": "2024-09-27T20:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 757,
    "name": "Черговий лікар, 4 сезон, 4 с",
    "time": "2024-09-27T20:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 763,
    "name": "NCIS: Полювання на вбивцю, 8 сезон, 15 с",
    "time": "2024-09-27T19:50:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 728,
    "name": "Південний парк, 5 сезон, 6 с",
    "time": "2024-09-27T19:35:00.000Z",
    "channel": "Paramount Comedy",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 747,
    "name": "Найкращий стрілець",
    "time": "2024-09-27T19:15:00.000Z",
    "channel": "1+1 Україна",
    "type": "MOVIE"
  },
  {
    "id": 727,
    "name": "Фрейзер, 1 сезон, 22 с",
    "time": "2024-09-27T19:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 887,
    "name": "Поліцейські вертольотчики, 1 сезон, 7 с",
    "time": "2024-09-27T19:00:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 693,
    "name": "Одного разу під Полтавою, 221 і 222 с",
    "time": "2024-09-27T19:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 756,
    "name": "Черговий лікар, 4 сезон, 3 с",
    "time": "2024-09-27T19:00:00.000Z",
    "channel": "СТБ",
    "type": "SERIES"
  },
  {
    "id": 773,
    "name": "Токарєв",
    "time": "2024-09-27T18:55:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 819,
    "name": "Заборонений плід, 420 с",
    "time": "2024-09-27T18:50:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 827,
    "name": "Кістки, 10 сезон, 10-12 с",
    "time": "2024-09-27T18:45:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 721,
    "name": "Король Квінса, 2 сезон, 21 с",
    "time": "2024-09-27T18:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 886,
    "name": "Гаряча точка, 4 сезон, 16 с",
    "time": "2024-09-27T18:15:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 833,
    "name": "Пуаро Агати Крісті, 5 сезон, 5 і 6 с",
    "time": "2024-09-27T18:00:00.000Z",
    "channel": "Enter-фільм",
    "type": "SERIES"
  },
  {
    "id": 692,
    "name": "Одного разу під Полтавою, 187 і 188 с",
    "time": "2024-09-27T18:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 869,
    "name": "Леді Баг і Супер-Кіт",
    "time": "2024-09-27T18:00:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 818,
    "name": "Заборонений плід, 419 с",
    "time": "2024-09-27T17:55:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 720,
    "name": "Король Квінса, 2 сезон, 20 с",
    "time": "2024-09-27T17:55:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 713,
    "name": "Король Квінса, 2 сезон, 19 с",
    "time": "2024-09-27T17:30:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 885,
    "name": "Гаряча точка, 4 сезон, 15 с",
    "time": "2024-09-27T17:25:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 780,
    "name": "Двійник",
    "time": "2024-09-27T17:15:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 719,
    "name": "Правила спільного життя, 3 сезон, 4 с",
    "time": "2024-09-27T17:05:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 826,
    "name": "Медіум, 6 сезон, 14 і 15 с",
    "time": "2024-09-27T17:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 817,
    "name": "Заборонений плід, 418 с",
    "time": "2024-09-27T17:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 772,
    "name": "Пророк",
    "time": "2024-09-27T17:00:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 718,
    "name": "Правила спільного життя, 3 сезон, 3 с",
    "time": "2024-09-27T16:40:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 725,
    "name": "Усі ненавидять Кріса, 2 сезон, 22 с",
    "time": "2024-09-27T16:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 802,
    "name": "Криваві квіти, 40 с",
    "time": "2024-09-27T16:10:00.000Z",
    "channel": "К2",
    "type": "SERIES"
  },
  {
    "id": 825,
    "name": "Інспектор Алекс, 10 сезон, 1 с",
    "time": "2024-09-27T16:10:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 691,
    "name": "Євродиректор, 17-20 с",
    "time": "2024-09-27T16:00:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 816,
    "name": "Крила кохання, 151 с",
    "time": "2024-09-27T16:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 724,
    "name": "Усі ненавидять Кріса, 2 сезон, 21 с",
    "time": "2024-09-27T15:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 877,
    "name": "Центральна лікарня, 16 і 17 с",
    "time": "2024-09-27T15:25:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 741,
    "name": "Виходьте без дзвінка, 3 сезон, 26 с. Прощавай, зброє",
    "time": "2024-09-27T15:25:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 801,
    "name": "Криваві квіти, 39 с",
    "time": "2024-09-27T15:20:00.000Z",
    "channel": "К2",
    "type": "SERIES"
  },
  {
    "id": 723,
    "name": "Беккер, 5 сезон, 14 с",
    "time": "2024-09-27T15:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 815,
    "name": "Крила кохання, 150 с",
    "time": "2024-09-27T15:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 798,
    "name": "Мачо і ботан",
    "time": "2024-09-27T14:55:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 722,
    "name": "Беккер, 5 сезон, 13 с",
    "time": "2024-09-27T14:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 740,
    "name": "Виходьте без дзвінка, 3 сезон, 25 с. Дочка мафії",
    "time": "2024-09-27T14:25:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 814,
    "name": "Крила кохання, 149 с",
    "time": "2024-09-27T14:05:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 876,
    "name": "Обручка з рубіном, 36 і 37 с",
    "time": "2024-09-27T13:35:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 824,
    "name": "Інспектор Алекс, 9 сезон, 11-13 с",
    "time": "2024-09-27T13:35:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 739,
    "name": "Виходьте без дзвінка, 3 сезон, 24 с. Звір у масці",
    "time": "2024-09-27T13:25:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 779,
    "name": "Форсаж 6",
    "time": "2024-09-27T13:20:00.000Z",
    "channel": "2+2",
    "type": "MOVIE"
  },
  {
    "id": 813,
    "name": "Крила кохання, 148 с",
    "time": "2024-09-27T13:05:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 754,
    "name": "Вибух із минулого",
    "time": "2024-09-27T12:45:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 760,
    "name": "NCIS: Полювання на вбивцю, 11 сезон, 17 і 18 с",
    "time": "2024-09-27T12:35:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 832,
    "name": "Пуаро Агати Крісті, 5 сезон, 1 і 2 с",
    "time": "2024-09-27T12:35:00.000Z",
    "channel": "Enter-фільм",
    "type": "SERIES"
  },
  {
    "id": 797,
    "name": "Росомаха. Безсмертний",
    "time": "2024-09-27T12:20:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 710,
    "name": "Усі ненавидять Кріса, 2 сезон, 20 с",
    "time": "2024-09-27T12:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 812,
    "name": "Заборонений плід, 417 с",
    "time": "2024-09-27T12:10:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 770,
    "name": "Ґодзила проти Конґа",
    "time": "2024-09-27T11:55:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 709,
    "name": "Усі ненавидять Кріса, 2 сезон, 19 с",
    "time": "2024-09-27T11:55:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 759,
    "name": "NCIS: Полювання на вбивцю, 8 сезон, 14 с",
    "time": "2024-09-27T11:45:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 883,
    "name": "Гаряча точка, 4 сезон, 13 с",
    "time": "2024-09-27T11:10:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 811,
    "name": "Заборонений плід, 416 с",
    "time": "2024-09-27T11:10:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 753,
    "name": "Джордж із джунглів",
    "time": "2024-09-27T10:55:00.000Z",
    "channel": "ICTV 2",
    "type": "MOVIE"
  },
  {
    "id": 823,
    "name": "Кістки, 10 сезон, 7-9 с",
    "time": "2024-09-27T10:50:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 875,
    "name": "Земля вовків, 3 сезон, 3 і 4 с",
    "time": "2024-09-27T10:45:00.000Z",
    "channel": "Суспільне Культура",
    "type": "SERIES"
  },
  {
    "id": 831,
    "name": "Пуаро Агати Крісті, 6 сезон, 4 с",
    "time": "2024-09-27T10:40:00.000Z",
    "channel": "Enter-фільм",
    "type": "SERIES"
  },
  {
    "id": 717,
    "name": "Правила спільного життя, 3 сезон, 2 с",
    "time": "2024-09-27T10:15:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 882,
    "name": "Гаряча точка, 4 сезон, 12 с",
    "time": "2024-09-27T10:15:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 810,
    "name": "Заборонений плід, 415 с",
    "time": "2024-09-27T10:05:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 758,
    "name": "Гаваї 5.0, 6 сезон, 24 і 25 с",
    "time": "2024-09-27T10:05:00.000Z",
    "channel": "НТН",
    "type": "SERIES"
  },
  {
    "id": 822,
    "name": "Медіум, 6 сезон, 13 с",
    "time": "2024-09-27T10:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 716,
    "name": "Правила спільного життя, 3 сезон, 1 с",
    "time": "2024-09-27T09:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 715,
    "name": "Беккер, 5 сезон, 12 с",
    "time": "2024-09-27T09:20:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 881,
    "name": "Гаряча точка, 4 сезон, 11 с",
    "time": "2024-09-27T09:20:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 769,
    "name": "Ґодзила II: Король монстрів",
    "time": "2024-09-27T09:10:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 796,
    "name": "Кінг Конг",
    "time": "2024-09-27T08:55:00.000Z",
    "channel": "ТЕТ",
    "type": "MOVIE"
  },
  {
    "id": 714,
    "name": "Беккер, 5 сезон, 11 с",
    "time": "2024-09-27T08:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 697,
    "name": "Фрейзер, 1 сезон, 20 с",
    "time": "2024-09-27T08:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 752,
    "name": "CSI: Місце злочину - Маямі, 5 сезон, 16-18 с",
    "time": "2024-09-27T08:10:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 696,
    "name": "Фрейзер, 1 сезон, 19 с",
    "time": "2024-09-27T08:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 777,
    "name": "Касл, 7 сезон, 7 і 8 с",
    "time": "2024-09-27T07:20:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 712,
    "name": "Король Квінса, 2 сезон, 18 с",
    "time": "2024-09-27T07:10:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 795,
    "name": "Ріо",
    "time": "2024-09-27T07:10:00.000Z",
    "channel": "ТЕТ",
    "type": "CARTOON"
  },
  {
    "id": 711,
    "name": "Король Квінса, 2 сезон, 17 с",
    "time": "2024-09-27T06:45:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 800,
    "name": "Криваві квіти, 38 с",
    "time": "2024-09-27T06:15:00.000Z",
    "channel": "К2",
    "type": "SERIES"
  },
  {
    "id": 690,
    "name": "Одного разу під Полтавою, 185 і 186 с",
    "time": "2024-09-27T06:10:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 799,
    "name": "Криваві квіти, 37 с",
    "time": "2024-09-27T06:01:00.000Z",
    "channel": "К2",
    "type": "SERIES"
  },
  {
    "id": 768,
    "name": "Будиночок на щастя",
    "time": "2024-09-27T06:01:00.000Z",
    "channel": "Новий канал",
    "type": "SERIES"
  },
  {
    "id": 689,
    "name": "Одного разу під Полтавою, 147 і 148 с",
    "time": "2024-09-27T05:05:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 776,
    "name": "Касл, 7 сезон, 1-3 с",
    "time": "2024-09-27T04:45:00.000Z",
    "channel": "2+2",
    "type": "SERIES"
  },
  {
    "id": 794,
    "name": "Одного разу під Полтавою, 15 сезон, 10 с",
    "time": "2024-09-27T04:30:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 793,
    "name": "Одного разу під Полтавою, 15 сезон, 15 с",
    "time": "2024-09-27T04:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 706,
    "name": "Теле-тато у відставці, 2 сезон, 16 с",
    "time": "2024-09-27T03:50:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 849,
    "name": "Волохатий блог",
    "time": "2024-09-27T03:45:00.000Z",
    "channel": "ПлюсПлюс",
    "type": "CARTOON_SERIES"
  },
  {
    "id": 792,
    "name": "Одного разу під Полтавою, 15 сезон, 9 с",
    "time": "2024-09-27T03:35:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 705,
    "name": "Теле-тато у відставці, 2 сезон, 15 с",
    "time": "2024-09-27T03:25:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 688,
    "name": "Одного разу під Полтавою, 107 і 108 с",
    "time": "2024-09-27T03:05:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 821,
    "name": "Село на мільйон, 2 сезон, 1 і 2 с",
    "time": "2024-09-27T03:00:00.000Z",
    "channel": "УНІАН ТБ",
    "type": "SERIES"
  },
  {
    "id": 767,
    "name": "Кролик Петрик",
    "time": "2024-09-27T03:00:00.000Z",
    "channel": "Новий канал",
    "type": "MOVIE"
  },
  {
    "id": 704,
    "name": "Теле-тато у відставці, 2 сезон, 14 с",
    "time": "2024-09-27T03:00:00.000Z",
    "channel": "Paramount Comedy",
    "type": "SERIES"
  },
  {
    "id": 790,
    "name": "Як козаки у футбол грали",
    "time": "2024-09-27T02:40:00.000Z",
    "channel": "ТЕТ",
    "type": "CARTOON"
  },
  {
    "id": 880,
    "name": "Поліцейські вертольотчики, 1 сезон, 6 с",
    "time": "2024-09-27T02:25:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 789,
    "name": "Одного разу під Полтавою, 14 сезон, 18 с",
    "time": "2024-09-27T02:15:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 788,
    "name": "Вечірка 2, 5 с",
    "time": "2024-09-27T01:45:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 879,
    "name": "Поліцейські вертольотчики, 1 сезон, 5 с",
    "time": "2024-09-27T01:40:00.000Z",
    "channel": "МИ - УКРАЇНА + HD",
    "type": "SERIES"
  },
  {
    "id": 787,
    "name": "Вечірка 2, 4 с",
    "time": "2024-09-27T01:15:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 687,
    "name": "Одного разу під Полтавою, 220 с",
    "time": "2024-09-27T01:05:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 749,
    "name": "Чак, 3 сезон, 15 і 16 с",
    "time": "2024-09-27T00:45:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 786,
    "name": "Королі палат, 13 с",
    "time": "2024-09-27T00:25:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 809,
    "name": "Хамелеон, 22 с",
    "time": "2024-09-27T00:00:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  },
  {
    "id": 785,
    "name": "Королі палат, 12 с",
    "time": "2024-09-27T00:00:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 735,
    "name": "Майже одружені, 18 с",
    "time": "2024-09-27T00:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 686,
    "name": "Зірконавти, 3 і 4 с",
    "time": "2024-09-26T23:55:00.000Z",
    "channel": "Квартал ТВ",
    "type": "SERIES"
  },
  {
    "id": 784,
    "name": "Одного разу під Полтавою, 14 сезон, 14 с",
    "time": "2024-09-26T23:35:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 783,
    "name": "Одного разу під Полтавою, 3 сезон, 14 с",
    "time": "2024-09-26T23:10:00.000Z",
    "channel": "ТЕТ",
    "type": "SERIES"
  },
  {
    "id": 750,
    "name": "CSI: Місце злочину - Маямі, 5 сезон, 14 і 15 с",
    "time": "2024-09-26T23:05:00.000Z",
    "channel": "ICTV 2",
    "type": "SERIES"
  },
  {
    "id": 829,
    "name": "Поки є час",
    "time": "2024-09-26T23:00:00.000Z",
    "channel": "Enter-фільм",
    "type": "MOVIE"
  },
  {
    "id": 734,
    "name": "Майже одружені, 14 с",
    "time": "2024-09-26T23:00:00.000Z",
    "channel": "ТВІЙ СЕРІАЛ",
    "type": "SERIES"
  },
  {
    "id": 807,
    "name": "Щоденники Темного, 21 с",
    "time": "2024-09-26T22:55:00.000Z",
    "channel": "Бігуді",
    "type": "SERIES"
  }
];

export const useFetchEvents = (): Output => {
  const [events, setEvents] = useState<TVEvent[]>(eventsNew);
  const [loading, setLoading] = useState(false);

  // useEffect(() => {
  //   const fetchEvents = async () => {
  //     try {
  //       const response = await fetch('/api/src/events.ts');
  //
  //       setEvents(await response.json());
  //       setLoading(false);
  //     } catch (error) {
  //       console.log('🚨', 'Error while fetching events:', error);
  //     }
  //   }
  //
  //   fetchEvents();
  // }, []);

  return { events, loading };
}